/************************     הוראות חשובות      ***********************/

/**
 
 1.   במידה וזאת פעם ראשונה שלכם ממלאים תוכן בלומדה, קראו את **קובץ הוורד** המצורף בתקייה
 2.   בעמוד זה יש למלא את הפרטים לגבי כל המידע והתוכן המבוקש
 3.   [amountOfQuestions במשתנה] לשים לב שבכל נושא צריך לכתוב את *כמות השאלות המקסימלית* שתלקח ממנו
      **משתנה זה מתייחס רק לשאלות שיילקחו בשביל **המבחן
 */


/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = "לומדת ת\"ש";

/****     הכנס כמות כוללת מקסימלית של שאלות למבחן. יש לשים לב לכמות השאלות הקיימות מהבהד - שלא כמות שלא קיימת   *******/
const AMOUNT_EXAM_QUESTIONS = 30;

/************************      הכנס כמות זמן התחלתית של המבחן      ***********************/
const TIME_FOR_EXAM = "40:00";

// אובייקט המכיל את כל המידע של הלומדה הכולל את התוכן, השאלות לכל נושא וכמות השאלות שיילקח מכל נושא למבחן
const DATA = {
    // שם נושא
    "בחינת ת\"ש": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        // שאלות לנושא הזה
        "questionsExam": [
            {
                type: "multiple",
                question: `בפיקוד אכ"א, בסיסי טירונים ובה"די
            הכשרות ע"י מי תבחן הבקשה?`,
                ans1: `רת"ח פרט וגיוסים במיטב`,
                ans2: `ראש אכ"א`,
                ans3: `קצינת ת"ש יחידתית`,
                ans4: `משקית הת"ש`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מי הוא הגורם המאשר של הת"ש סוציאלי או
            רפואי?`,
                ans1: `מדור פרט במיטב.`,
                ans2: `מפקד היחידה ובמקרה פליטה סמכות
            התגבורת.`,
                ans3: `סמכות התגבורת.`,
                ans4: `רופא היחידה.`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מי הוא הגורם המאשר הת"ש מטעמים נפשיים?`,
                ans1: `מדור פרט במיטב`,
                ans2: `סמכות התגבורת`,
                ans3: `מפקד היחידה ובמקרה פליטה סמכות
            התגבורת`,
                ans4: `קצינת הת"ש`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האם ניתן להגיש הת"ש על מחלה סופנית של
            קרוב מדרגה ראשונה למרות שאינו זקוק
            לסיוע? אם כן מי הוא הגורם המאשר?`,
                ans1: `כן, מדור פרט במיטב.`,
                ans2: `כן, מפקד היחידה ובמקרה פליטה סמכות
            התגבורת.`,
                ans3: `לא, לא ניתן להגיש כלל.`,
                ans4: `כן. באישור משקית הת"ש.`,
                correctAns: "ans2"
            },
        ],
        "questionsPractice": [
            {
                type: "multiple",
                question: `בפיקוד אכ"א, בסיסי טירונים ובה"די
            הכשרות ע"י מי תבחן הבקשה?`,
                ans1: `רת"ח פרט וגיוסים במיטב`,
                ans2: `ראש אכ"א`,
                ans3: `קצינת ת"ש יחידתית`,
                ans4: `משקית הת"ש`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מי הוא הגורם המאשר של הת"ש סוציאלי או
            רפואי?`,
                ans1: `מדור פרט במיטב.`,
                ans2: `מפקד היחידה ובמקרה פליטה סמכות
            התגבורת.`,
                ans3: `סמכות התגבורת.`,
                ans4: `רופא היחידה.`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מי הוא הגורם המאשר הת"ש מטעמים נפשיים?`,
                ans1: `מדור פרט במיטב`,
                ans2: `סמכות התגבורת`,
                ans3: `מפקד היחידה ובמקרה פליטה סמכות
            התגבורת`,
                ans4: `קצינת הת"ש`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האם ניתן להגיש הת"ש על מחלה סופנית של
            קרוב מדרגה ראשונה למרות שאינו זקוק
            לסיוע? אם כן מי הוא הגורם המאשר?`,
                ans1: `כן, מדור פרט במיטב.`,
                ans2: `כן, מפקד היחידה ובמקרה פליטה סמכות
            התגבורת.`,
                ans3: `לא, לא ניתן להגיש כלל.`,
                ans4: `כן. באישור משקית הת"ש.`,
                correctAns: "ans2"
            },
        ],
        "amountOfQuestions": 4,
        "learningContent": {
            "ביקור בית": {
                "מטרה והיערכות": [
                    {
                        cardType: "text",
                        content: `מטרת ביקור הבית היא התרשמות, איסוף
                        מידע ואימות מידע אשר נמסר על- ידי החייל
                        לבקשות השונות אשר הגיש.`
                    },
                ],
                "על ידי מי נערך הביקור": [
                    {
                        cardType: "text",
                        content: `ביקור בית לבקשות הת"ש של חייל ייערך
                        בתוך שבעה ימי עבודה מיום הגשת האישורים
                        הרלוונטיים על ידי החייל. ביקור הבית ייערך
                        על ידי משקית הת"ש, ומומלץ לערוך אותו עם
                        מפקד החייל.`
                    },
                ],
                'ביקורי בית': [
                    {
                        cardType: "_3titles_3text",
                        subTitle1: "סוגי בקשות להן יש לערוך ביקור בית: ",
                        content1: `<ul class="list"><li>בקשות חייל לסיוע כלכלי- מוצרים מקרן
                        הסיוע של יל״ח</li><li>תשלומי משפחה</li><li>בקשת חייל להקלות בתנאי שירות</li></ul>`,
                        subTitle2: "ביקור בית מפקד לקראת החגים",
                        content2: `
                        אוכלוסיה נדרשת- חיילי סגל ומפקדה ביחידה
                        בלבד, ללא חניכים בקורסים והכשרות,
                        שעונים על הקריטריונים המפורטים: <br>
                        א. חיילים המוכרים כבודדים בצה״ל. <br>
                        ב. חיילים הזכאים לתשמ״ש (הורים /נשוי).<br>
                        ג. חיילים בעלי הת״ש 5 או הת״ש 7 .<br>
                        ד. חיילים שהינם נשואים.<br>
                        ה. חיילים שהינם עולים חדשים`
                    },

                ],

            },
        },
    },
    // שם נושא
    "זכאות ת\"ש": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        // שאלות לנושא הזה
        "questionsExam": [
            {
                type: "multiple",
                question: `האם ניצול של חופשה מיוחדת לחייל זכאי
            הת"ש שווה ערך לניצול זכאותו להת"ש?`,
                ans1: `לא. יש לאפשר לחייל לנצל גם חופשה
            מיוחדת וגם הת"ש בו זמנית.`,
                ans2: `חייל עם הת"ש לא יכול לנצל חופשה
            מיוחדת.`,
                ans3: `לא.`,
                ans4: `כן. חייל המנצל חופשה מיוחדת כאילו
            ניצל את זכאותו להת"ש באותו השבוע.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם ימי גימלים מחליפים את ימי הזכאות של הת"ש?`,
                ans1: `לא. במידה וחייל זכאי הת"ש שהה בביתו
            עקב גימלים, הדבר אינו בא במקום מימוש ההת"ש.`,
                ans2: `כן, הרי בגימלים החייל נמצא גם ככה בבית.`,
                ans3: `כן. לא ניתן לממש גם גימלים וגם הת"ש
            באותו השבוע.`,
                ans4: `לא.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מה קורה כאשר נפטר קרוב מדרגה ראשונה
            של חייל בודד או הלנ"פ שאינו בקשר עם
            הוריו?`,
                ans1: `החייל יהיה זכאי אוטומטית להת"ש 3
            פטירה טרייה.`,
                ans2: `סמכות מפקדו הישיר להחליט אם יהיה
            זכאי להת"ש או לא.`,
                ans3: `על החייל להגיש בקשה להת"ש 3
            שתבחן ע"י מפקדיו.`,
                ans4: `החייל יוצא לחופשה של חודשיים.`,
                correctAns: "ans3"
            },
        ],
        "questionsPractice": [
            {
                type: "multiple",
                question: `האם ניצול של חופשה מיוחדת לחייל זכאי
        הת"ש שווה ערך לניצול זכאותו להת"ש?`,
                ans1: `לא. יש לאפשר לחייל לנצל גם חופשה
        מיוחדת וגם הת"ש בו זמנית.`,
                ans2: `חייל עם הת"ש לא יכול לנצל חופשה
        מיוחדת.`,
                ans3: `לא.`,
                ans4: `כן. חייל המנצל חופשה מיוחדת כאילו
        ניצל את זכאותו להת"ש באותו השבוע.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם ימי גימלים מחליפים את ימי הזכאות של הת"ש?`,
                ans1: `לא. במידה וחייל זכאי הת"ש שהה בביתו
        עקב גימלים, הדבר אינו בא במקום מימוש ההת"ש.`,
                ans2: `כן, הרי בגימלים החייל נמצא גם ככה בבית.`,
                ans3: `כן. לא ניתן לממש גם גימלים וגם הת"ש
        באותו השבוע.`,
                ans4: `לא.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מה קורה כאשר נפטר קרוב מדרגה ראשונה
        של חייל בודד או הלנ"פ שאינו בקשר עם
        הוריו?`,
                ans1: `החייל יהיה זכאי אוטומטית להת"ש 3
        פטירה טרייה.`,
                ans2: `סמכות מפקדו הישיר להחליט אם יהיה
        זכאי להת"ש או לא.`,
                ans3: `על החייל להגיש בקשה להת"ש 3
        שתבחן ע"י מפקדיו.`,
                ans4: `החייל יוצא לחופשה של חודשיים.`,
                correctAns: "ans3"
            },],
        "amountOfQuestions": 3,
        "learningContent": {
            "זכאות כללית": {
                "זכאות לפתיחת ת\"ש": [
                    {
                        cardType: "text",
                        content: `
                    מי זכאי לפתיחת בקשת ת״ש: <br>
                    א. קרוב משפחה מקרבה ראשונה של החייל<br>
                    נזקק לסיוע של החייל לתפקוד היום-יומי.
                    ב. חייל אשר קרוב משפחה מקרבה ראשונה<br>
                    נפטר וטרם חלפה שנה ממועד הפטירה.
                    ג. חייל אשר הינו בן למשפחה שכולה/ נפגעי<br>
                    פעולות איבה.<br>
                    ד. חייל אשר הינו בן/ אח של נכה צה״ל עם
                    %100 נכות.<br>
                    ה. חייל המשתייך לקהילת השומרונים,
                    הקראים או העבריים מדימונה.<br>
                    ו. חייל המשתייך לאוכלוסיית קהילת בית אל.<br>
                    ז. בן זכר יחיד לעדה הדרוזית`
                    }
                ]
            }, "ספורטאי מצטיין": {
                "ספורטאים, רקדנים, מוזיקאים פעילים ומצטיינים:": [
                    {
                        cardType: "text",
                        content: `ניתן לשלול את מעמדו כמצטיין או כספורטאי 
                        פעיל מהטעמים הבאים:
                        <ul class="list">
                        <li>הישגים בלתי נאותים של החייל.</li>
                        <li>החייל אינו נוהג בשקידה הראויה בהכשרה
                        או באימוניו בתחום הצטיינותו.</li>
                        <li>החייל מתנהג באופן בלתי הולם במהלך
                        שירותו הצבאי.</li>
                        <li>נמצא כי הנתונים שעמדו ביסוד אישור בקשת
                        החייל, כולם או מקצתם, לא היו מדויקים או
                        אינם רלוונטיים עוד.</li>
                        <li>טעמים מיוחדים אחרים שירשמו.</li></ul>`
                    }
                ]
            },
            "סוגי היתרי עבודה": {
                "סוגי היתרי עבודה פרטית": [
                    {
                        cardType: "text",
                        content: `היתרי עבודה פרטית יינתנו מהטעמים
                        המפורטים להלן: <br>
                        א. היתר עבודה מטעמי מצוקה כלכלית.<br>
                        ב. היתר עבודה פרטית בגין התנדבות
                        בקהילה.<br>
                        ג. היתר עבודה פרטית עבור ספורטאי מצטיין/
                        פעיל.<br>
                        ד. היתר עבודה פרטית בגין התמחות
                        מקצועית.<br>
                        ה. היתר עבודה חריג.`
                    }
                ]
            }
        },

    },
    // שם נושא
    "קבלת ת\"ש": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "questionsExam": [
            {
                type: "multiple",
                question: `האם הלילות של שישי ושל שבת נחשבים
            כלילה אחד בבית?`,
                ans1: `כן, רק ביחידות קרביות.`,
                ans2: `לא, כל לילה הוא לילה אחד.`,
                ans3: `לא`,
                ans4: `כן`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `חייל שקיבל הת"ש 3 ומעלה ומתגורר מעל
            ל-100 ק"מ מיחידתו תוך כמה זמן יש לפלוט
            אותו?`,
                ans1: `תוך עשרה ימי עבודה`,
                ans2: `תוך שבועיים`,
                ans3: `מיידית`,
                ans4: `תוך ארבעה ימים`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם ניתן להעניש חייל זכאי הת"ש ובכל זאת לפגוע
            במימוש ההטבה? אם כן מה המגבלות?`,
                ans1: `כן, רק במידה והחיייל מסכים לכך.`,
                ans2: `לא, אלא באישור של מפקד בדרגת אל"מ
            ומעלה.`,
                ans3: `כן.`,
                ans4: `כן. עונש ריתוק "גובר" על כל הקלת ת"ש
            או הטבה אחרת לה זכאי החייל, למעט
            הקלות ופטורים מסיבות רפואיות (הת"ש
            הניתן לחייל מידי רופא/קב"ן).`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם חייל זכאי הת"ש מחויב לצאת לקורסים
            שנכללים במסלולו הצבאי? במידה וכן, האם
            בקורס מחויבים לממש את זכאותו?`,
                ans1: `כן. יממש את זכאותו לפי החלטת מפקד
            היחידה.`,
                ans2: `לא. לא יצא לקורס במידה ולא ירצה.`,
                ans3: `כן. בקורס מחויבים לממש את זכאותו`,
                ans4: `לא`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מי הגורם המאשר הת"ש סוציאלי חריג?`,
                ans1: `מדור פרט במיטב`,
                ans2: `קצינת ת"ש חונכת`,
                ans3: `משקית ת"ש`,
                ans4: `אותו התהליך כמו הת"ש רפואי רגיל:
            במידה וניתן למצות את החייל ביחידה - 
            מפקד היחידה, במידה ויש לפלוט את
            החייל - סמכות התגבורות.
            `,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מה קורה אם קרוב משפחה עבורו היה זכאי
            החייל להת"ש נפטר?`,
                ans1: `החייל ימשיך להיות זכאי להטבה עד
            לשחרורו.`,
                ans2: `יש לתת לחייל תקופת התארגנות בת חודשיים
            מיום הפטירה. בתום תקופה זו תיבחן זכאותו
             מחדש.`,
                ans3: `עם חזרת החייל מהשבעה, ידון מפקד .
            היחידה בהטבתו.`,
                ans4: `החייל לא יהיה זכאי להטבה מאותו
            הרגע.`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `האם ניתן להגיש בקשה להת"ש בהכשרה
            ראשונית?`,
                ans1: `כן`,
                ans2: `כן, רק אם הבקשה דחופה.`,
                ans3: `לא, ניתן להגיש בקשה להת"ש רק
            ביחידת הסדיר בה החייל ישרת.`,
                ans4: `לא`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם משקית ת"ש ביחידה פתוחה צריכה
            להגיש הת"ש? למה?`,
                ans1: `לא. לא ניתן להגיש הת"ש ביחידה פתוחה,
            גם ככה עושים יומיות.`,
                ans2: `כן, ממספר הת"ש מסוים מקבלים תווים
            בחוגר.`,
                ans3: `לא צריכה להגיש. `,
                ans4: `כן, ממספר הת"ש מסוים,ניתן לעשות
            מספר מוגבל של תעסוקה מבצעית
            ומשימות אבטחה.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם ניתן להגיש במקרים חריגים בקשת הת"ש
            עבור סבא/סבתא? אם כן אילו אישורים נדרשים
            מהחייל להביא?`,
                ans1: `לא, בקשת הת"ש היא רק בעבור קרובים
            מדרגה ראשונה.`,
                ans2: `כן, אין צורך להביא אישורים תומכים.`,
                ans3: `לא.`,
                ans4: `כן, אותם אישורים כמו בהת"ש רגיל.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם ההת"ש מחייב לינה בבית בימים
            קבועים?`,
                ans1: `כן, על פי בקשת החייל.`,
                ans2: `לא, על פי החלטת מפקדי החייל
            ובשיתופו.`,
                ans3: `כן, על פי החלטת מפקד היחידה.`,
                ans4: `לא`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מה הוא הת"ש 01?`,
                ans1: `הת"ש למשפחות להן בנים זכרים יחידים
            בני העדה הדרוזית.`,
                ans2: `הת"ש למשפחות דרוזיות להן ילדים
            יחידים.`,
                ans3: `הת"ש לבנים למשפחות מוסלמיות.`,
                ans4: `הת"ש למשפחות מוסלמיות להן ילדים
            יחידים.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `לאיזה סוג הת"ש זכאי חייל אשר משתייך
            לקהילת בית-אל?`,
                ans1: `הת"ש 99`,
                ans2: `הת"ש 3`,
                ans3: `הת"ש 7`,
                ans4: `הת"ש לפי החלטת מפקדים.`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `עד איזה שעה חייל אשר זכאי הת"ש יצטרך
            להגיע הביתה?`,
                ans1: `21:00`,
                ans2: `20:00`,
                ans3: `16:00`,
                ans4: `18:00`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מה הם הקרטריונים להת"ש חריג?`,
                ans1: `כל סיבה הדורשת את נוכחות החייל בבית.`,
                ans2: `קושי נפשי/רגשי של החייל.`,
                ans3: `הקרטריונים יקבעו על פי מפקד החייל.`,
                ans4: `קושי כלכלי של החייל.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם הת"ש 3 ומעלה מוריד חייל בצורה
            אוטומטית מתפקידי הלוחמה השונים?`,
                ans1: `כן. לוחם לא יכול להיות זכאי הת"ש.
            מתוקף תפקידו.`,
                ans2: `לא. במידה ומפקד החייל מוצא כי באפשרותו
            למצות את החייל ביחידה, הוא רשאי לעשות כן.`,
                ans3: `לא, יש להעלות את הבקשה לסמכות
            התגבורת להחלטה בנושא.`,
                ans4: `לא.`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מנו את האוכלוסיות שלהן מגיע הת"ש
            מובנה.`,
                ans1: `חיילים המשתייכים לעדה
            הקראית/שומרונית/עבריים
            מדימונה/קהילת בית אל בלבד.`,
                ans2: `בנים למשפחות שכולות/נפגעי פעולות
            איבה/אחים או הורים נכי צה"ל בעלי %100
            נכות, פטירת קרוב מדרגה ראשונה בחמשת
            שנים האחרונות, חיילים שלהוריהם בעיה
            רפואית.`,
                ans3: `כל התשובות נכונות`,
                ans4: `בנים למשפחות שכולות/נפגעי פעולות
            איבה/אחים או הורים נכי צה"ל בעלי
            %100 נכות, פטירת קרוב מדרגה ראשונה
            בחמשת שנים האחרונות, חיילים
            המשתייכים לעדה
            הקראית/שומרונית/עבריים
            מדימונה/קהילת בית אל, חייל נשוי עם
            ילד,בן זכר לקהילה הדרוזית.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `לחייל דרוזי ביחידתך יש שלוש אחיות ואין
            אחים, האם הוא זכאי להת"ש? במידה וכן,
            איזה הת"ש ומי יהיה הגורם המאשר.`,
                ans1: `כן, זכאי להת"ש 01. במידה וההטבה אינה
            מוזנת לאחר גיוס החייל היא תוגש לבחינה
            לרת"ח פרט וגיוסים במיטב.`,
                ans2: `כן,זכאי להת"ש 03. באחריות ק.ת"ש
            יחידה להזין את ההטבה.`,
                ans3: `כן, זכאי להת"ש 03. במידה וההטבה אינה
            מוזנת לאחר גיוס החייל היא תוגש
            לבחינה לרת"ח פרט וגיוסים במיטב.`,
                ans4: `החייל לא זכאי להת"ש.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מה הם הגורמים להת"ש 99?`,
                ans1: `המצב הרפואי והכלכלי של החייל.`,
                ans2: `כל התשובות נכונות.`,
                ans3: `המצב הרפואי והכלכלי של משפחת
            החייל.`,
                ans4: `אין דבר כזה הת"ש 99, הוא שונה להת"ש
            7.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `הינך מש"ק/ית ת"ש בבסיס טירונים במחנה
            80. יניב ניגש אליך ומעוניין להגיש בקשה
            להת"ש סוציאלי. אילו אישורים תדרוש/י
            מיניב? האם תצטרך/י לערוך לו ביקור בית?`,
                ans1: `אין אפשרות להגיש הת"ש שלא מסיבה
            רפואית של אחד מקרובים מדרגה`,
                ans2: `החייל יידרש להציג כל אישור המעיד על ראשונה.
            מצבו של הקרוב (לדוגמא אישורי עו"ס,
            מכתבים אישיים, התייחסות רפואית) ויש
            לערוך לו ביקור בית`,
                ans3: `החייל יידרש להציג כל אישור המעיד על מצבו
            של הקרוב (לדוגמא אישורי עו"ס, מכתבים
            אישיים, התייחסות רפואית) ואין צורך לביקור בית`,
                ans4: `אין אפשרות להגיש הת"ש`,
                correctAns: "ans2"
            }
        ],
        "questionsPractice": [
            {
                type: "multiple",
                question: `האם הלילות של שישי ושל שבת נחשבים
            כלילה אחד בבית?`,
                ans1: `כן, רק ביחידות קרביות.`,
                ans2: `לא, כל לילה הוא לילה אחד.`,
                ans3: `לא`,
                ans4: `כן`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `חייל שקיבל הת"ש 3 ומעלה ומתגורר מעל
            ל-100 ק"מ מיחידתו תוך כמה זמן יש לפלוט
            אותו?`,
                ans1: `תוך עשרה ימי עבודה`,
                ans2: `תוך שבועיים`,
                ans3: `מיידית`,
                ans4: `תוך ארבעה ימים`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם ניתן להעניש חייל זכאי הת"ש ובכל זאת לפגוע
            במימוש ההטבה? אם כן מה המגבלות?`,
                ans1: `כן, רק במידה והחיייל מסכים לכך.`,
                ans2: `לא, אלא באישור של מפקד בדרגת אל"מ
            ומעלה.`,
                ans3: `כן.`,
                ans4: `כן. עונש ריתוק "גובר" על כל הקלת ת"ש
            או הטבה אחרת לה זכאי החייל, למעט
            הקלות ופטורים מסיבות רפואיות (הת"ש
            הניתן לחייל מידי רופא/קב"ן).`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם חייל זכאי הת"ש מחויב לצאת לקורסים
            שנכללים במסלולו הצבאי? במידה וכן, האם
            בקורס מחויבים לממש את זכאותו?`,
                ans1: `כן. יממש את זכאותו לפי החלטת מפקד
            היחידה.`,
                ans2: `לא. לא יצא לקורס במידה ולא ירצה.`,
                ans3: `כן. בקורס מחויבים לממש את זכאותו`,
                ans4: `לא`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מי הגורם המאשר הת"ש סוציאלי חריג?`,
                ans1: `מדור פרט במיטב`,
                ans2: `קצינת ת"ש חונכת`,
                ans3: `משקית ת"ש`,
                ans4: `אותו התהליך כמו הת"ש רפואי רגיל:
            במידה וניתן למצות את החייל ביחידה - 
            מפקד היחידה, במידה ויש לפלוט את
            החייל - סמכות התגבורות.
            `,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מה קורה אם קרוב משפחה עבורו היה זכאי
            החייל להת"ש נפטר?`,
                ans1: `החייל ימשיך להיות זכאי להטבה עד
            לשחרורו.`,
                ans2: `יש לתת לחייל תקופת התארגנות בת חודשיים
            מיום הפטירה. בתום תקופה זו תיבחן זכאותו
             מחדש.`,
                ans3: `עם חזרת החייל מהשבעה, ידון מפקד .
            היחידה בהטבתו.`,
                ans4: `החייל לא יהיה זכאי להטבה מאותו
            הרגע.`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `האם ניתן להגיש בקשה להת"ש בהכשרה
            ראשונית?`,
                ans1: `כן`,
                ans2: `כן, רק אם הבקשה דחופה.`,
                ans3: `לא, ניתן להגיש בקשה להת"ש רק
            ביחידת הסדיר בה החייל ישרת.`,
                ans4: `לא`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם משקית ת"ש ביחידה פתוחה צריכה
            להגיש הת"ש? למה?`,
                ans1: `לא. לא ניתן להגיש הת"ש ביחידה פתוחה,
            גם ככה עושים יומיות.`,
                ans2: `כן, ממספר הת"ש מסוים מקבלים תווים
            בחוגר.`,
                ans3: `לא צריכה להגיש. `,
                ans4: `כן, ממספר הת"ש מסוים,ניתן לעשות
            מספר מוגבל של תעסוקה מבצעית
            ומשימות אבטחה.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם ניתן להגיש במקרים חריגים בקשת הת"ש
            עבור סבא/סבתא? אם כן אילו אישורים נדרשים
            מהחייל להביא?`,
                ans1: `לא, בקשת הת"ש היא רק בעבור קרובים
            מדרגה ראשונה.`,
                ans2: `כן, אין צורך להביא אישורים תומכים.`,
                ans3: `לא.`,
                ans4: `כן, אותם אישורים כמו בהת"ש רגיל.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `האם ההת"ש מחייב לינה בבית בימים
            קבועים?`,
                ans1: `כן, על פי בקשת החייל.`,
                ans2: `לא, על פי החלטת מפקדי החייל
            ובשיתופו.`,
                ans3: `כן, על פי החלטת מפקד היחידה.`,
                ans4: `לא`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מה הוא הת"ש 01?`,
                ans1: `הת"ש למשפחות להן בנים זכרים יחידים
            בני העדה הדרוזית.`,
                ans2: `הת"ש למשפחות דרוזיות להן ילדים
            יחידים.`,
                ans3: `הת"ש לבנים למשפחות מוסלמיות.`,
                ans4: `הת"ש למשפחות מוסלמיות להן ילדים
            יחידים.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `לאיזה סוג הת"ש זכאי חייל אשר משתייך
            לקהילת בית-אל?`,
                ans1: `הת"ש 99`,
                ans2: `הת"ש 3`,
                ans3: `הת"ש 7`,
                ans4: `הת"ש לפי החלטת מפקדים.`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `עד איזה שעה חייל אשר זכאי הת"ש יצטרך
            להגיע הביתה?`,
                ans1: `21:00`,
                ans2: `20:00`,
                ans3: `16:00`,
                ans4: `18:00`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מה הם הקרטריונים להת"ש חריג?`,
                ans1: `כל סיבה הדורשת את נוכחות החייל בבית.`,
                ans2: `קושי נפשי/רגשי של החייל.`,
                ans3: `הקרטריונים יקבעו על פי מפקד החייל.`,
                ans4: `קושי כלכלי של החייל.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם הת"ש 3 ומעלה מוריד חייל בצורה
            אוטומטית מתפקידי הלוחמה השונים?`,
                ans1: `כן. לוחם לא יכול להיות זכאי הת"ש.
            מתוקף תפקידו.`,
                ans2: `לא. במידה ומפקד החייל מוצא כי באפשרותו
            למצות את החייל ביחידה, הוא רשאי לעשות כן.`,
                ans3: `לא, יש להעלות את הבקשה לסמכות
            התגבורת להחלטה בנושא.`,
                ans4: `לא.`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מנו את האוכלוסיות שלהן מגיע הת"ש
            מובנה.`,
                ans1: `חיילים המשתייכים לעדה
            הקראית/שומרונית/עבריים
            מדימונה/קהילת בית אל בלבד.`,
                ans2: `בנים למשפחות שכולות/נפגעי פעולות
            איבה/אחים או הורים נכי צה"ל בעלי %100
            נכות, פטירת קרוב מדרגה ראשונה בחמשת
            שנים האחרונות, חיילים שלהוריהם בעיה
            רפואית.`,
                ans3: `כל התשובות נכונות`,
                ans4: `בנים למשפחות שכולות/נפגעי פעולות
            איבה/אחים או הורים נכי צה"ל בעלי
            %100 נכות, פטירת קרוב מדרגה ראשונה
            בחמשת שנים האחרונות, חיילים
            המשתייכים לעדה
            הקראית/שומרונית/עבריים
            מדימונה/קהילת בית אל, חייל נשוי עם
            ילד,בן זכר לקהילה הדרוזית.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `לחייל דרוזי ביחידתך יש שלוש אחיות ואין
            אחים, האם הוא זכאי להת"ש? במידה וכן,
            איזה הת"ש ומי יהיה הגורם המאשר.`,
                ans1: `כן, זכאי להת"ש 01. במידה וההטבה אינה
            מוזנת לאחר גיוס החייל היא תוגש לבחינה
            לרת"ח פרט וגיוסים במיטב.`,
                ans2: `כן,זכאי להת"ש 03. באחריות ק.ת"ש
            יחידה להזין את ההטבה.`,
                ans3: `כן, זכאי להת"ש 03. במידה וההטבה אינה
            מוזנת לאחר גיוס החייל היא תוגש
            לבחינה לרת"ח פרט וגיוסים במיטב.`,
                ans4: `החייל לא זכאי להת"ש.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `מה הם הגורמים להת"ש 99?`,
                ans1: `המצב הרפואי והכלכלי של החייל.`,
                ans2: `כל התשובות נכונות.`,
                ans3: `המצב הרפואי והכלכלי של משפחת
            החייל.`,
                ans4: `אין דבר כזה הת"ש 99, הוא שונה להת"ש
            7.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `הינך מש"ק/ית ת"ש בבסיס טירונים במחנה
            80. יניב ניגש אליך ומעוניין להגיש בקשה
            להת"ש סוציאלי. אילו אישורים תדרוש/י
            מיניב? האם תצטרך/י לערוך לו ביקור בית?`,
                ans1: `אין אפשרות להגיש הת"ש שלא מסיבה
            רפואית של אחד מקרובים מדרגה`,
                ans2: `החייל יידרש להציג כל אישור המעיד על ראשונה.
            מצבו של הקרוב (לדוגמא אישורי עו"ס,
            מכתבים אישיים, התייחסות רפואית) ויש
            לערוך לו ביקור בית`,
                ans3: `החייל יידרש להציג כל אישור המעיד על מצבו
            של הקרוב (לדוגמא אישורי עו"ס, מכתבים
            אישיים, התייחסות רפואית) ואין צורך לביקור בית`,
                ans4: `אין אפשרות להגיש הת"ש`,
                correctAns: "ans2"
            }
        ],
        "amountOfQuestions": 5,
        "learningContent": {
            // סוג הכרטיסייה
            "תווי קניה":
            {
                "זכאות לתווי קניה": [
                    {
                        cardType: "text",
                        content: `
                            מי זכאי לתווי קנייה לרכוש מזון?
                            <ol class="list">
                            <li>זכאים אוטומטית:
                            <ul class="list"><li>חיילים בודדים בכל רמות הפעילות.</li>
                            <li>זכאי תשמ״ש הורים בכל רמות הפעילות.</li>
                            <li>זכאי תשמ״ש נשוי ותשמ״ש אח ברמת
                            פעילות א ומעלה בלבד.</li>
                            <li>חיילים בודדים וזכאי הלנה מטעמי פרט
                            המתגוררים בדירות ׳יחד למען החייל׳.</li>
                            </ul>
                            </li>
                            <li>זכאות לתווי קנייה לשיקול דעת מערך
                            הת״ש/ מפקדים.</li>
                            <li>א. תווי קנייה חד פעמיים.<br>
                            ב. תווי קנייה מתמשכים</li>
                            </ol>`
                    }
                ]
            }
        },
    },
    "בקשת ת\"ש": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 4,
        "questionsExam": [
            {
                type: "multiple",
                question: `איפה ניתן למצוא את כל המידע המקצועי
            במערך הת"ש?`,
                ans1: `ספר ניהול משרד המשא"ן.`,
                ans2: `ספר פקודות ונהלי יחידה.`,
                ans3: `ספר ניהול משרד הת"ש.`,
                ans4: `ספר פקודות רס"ר ליחידה`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `כמה ימים יש להחתים רופא יחידה + לבצע
            ביקור בית + החתמת מפקדים מרגע הבאת
            כלל האישורים והעלאתם למערכת (זמן תקן
            מיוחד)?`,
                ans1: `10  ימים להחתים רופא ולבצע ב"ב, 10 ימים להחתים מפקדים.`,
                ans2: `10 ימים להחתים רופא ולבצע ב"ב, 10 ימים להחתים מפקד ישיר ומפקד בדרגת סא"ל.`,
                ans3: `10 ימים להחתים רופא ולבצע ב"ב, 10 ימים להחתים מפקד ישיר ומפקד בדרגת סא"ל, 7 ימים להחתים מפקד בדרגת אל"מ.`,
                ans4: `10 ימים להחתים רופא ולבצע ב"ב.`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האם יש לארכב את כלל האישורים והטפסים
            למערכת מהבקשה?`,
                ans1: `כן, כדי שהאישורים והטפסים לא יאבדו.`,
                ans2: `לא, אין צורך, הבקשה בנוהל ידני.`,
                ans3: `כן, כדי שמפקדי החייל יוכלו לראותם.`,
                ans4: `לא, אין צורך.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם חייל בהכשרה ראשונית מחויב לקבל
            את זכאותו להת"ש?`,
                ans1: `כן, אך אין באפשרותו לממש אותו במהלך ההכשרה.`,
                ans2: `לא, אין הת"ש בהכשרה ראשונית.`,
                ans3: `כן.`,
                ans4: `לא.`,
                correctAns: "ans1"
            },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `איפה ניתן למצוא את כל המידע המקצועי
            במערך הת"ש?`,
                ans1: `ספר ניהול משרד המשא"ן.`,
                ans2: `ספר פקודות ונהלי יחידה.`,
                ans3: `ספר ניהול משרד הת"ש.`,
                ans4: `ספר פקודות רס"ר ליחידה`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `כמה ימים יש להחתים רופא יחידה + לבצע
            ביקור בית + החתמת מפקדים מרגע הבאת
            כלל האישורים והעלאתם למערכת (זמן תקן
            מיוחד)?`,
                ans1: `10  ימים להחתים רופא ולבצע ב"ב, 10 ימים להחתים מפקדים.`,
                ans2: `10 ימים להחתים רופא ולבצע ב"ב, 10 ימים להחתים מפקד ישיר ומפקד בדרגת סא"ל.`,
                ans3: `10 ימים להחתים רופא ולבצע ב"ב, 10 ימים להחתים מפקד ישיר ומפקד בדרגת סא"ל, 7 ימים להחתים מפקד בדרגת אל"מ.`,
                ans4: `10 ימים להחתים רופא ולבצע ב"ב.`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האם יש לארכב את כלל האישורים והטפסים
            למערכת מהבקשה?`,
                ans1: `כן, כדי שהאישורים והטפסים לא יאבדו.`,
                ans2: `לא, אין צורך, הבקשה בנוהל ידני.`,
                ans3: `כן, כדי שמפקדי החייל יוכלו לראותם.`,
                ans4: `לא, אין צורך.`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `האם חייל בהכשרה ראשונית מחויב לקבל
            את זכאותו להת"ש?`,
                ans1: `כן, אך אין באפשרותו לממש אותו במהלך ההכשרה.`,
                ans2: `לא, אין הת"ש בהכשרה ראשונית.`,
                ans3: `כן.`,
                ans4: `לא.`,
                correctAns: "ans1"
            },
        ],
        "learningContent": {
            // סוג הכרטיסייה
            "בקשות ת\"ש": {
                "בקשת הת\"ש סוציאלי": [
                    {
                        cardType: "text",
                        content: `חייל אשר מעוניין להגיש בקשה להת"ש
                        סוציאלי יידרש להציג כל אישור המעיד על
                        מצבו של הקרוב (לדוגמא: אישורי עו"ס,
                        מכתבים אישיים, התייחסות רפואית) ויש
                        לערוך ביקור בית.`
                    }
                ]
            }
        },

    },
    "תשמ\"ש": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 3,
        "questionsExam": [
            {
                type: "multiple",
                question: `למה מיועד תשמ״ש?`,
                ans1: `בקשה המיועדת להיתר עבודה פרטי`,
                ans2: `בקשה המיועדת למקום השיבוץ של החייל`,
                ans3: `בקשה המיועדת לעזרה רפואית של החייל`,
                ans4: `בקשה המיועדת לעזרה כלכלית ותמיכה להורי חייל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `החייל עידן ניגש למשקית הת״ש ושיתף אותה במצב המשפחה,שהם נמצאים בחובות לבנק, אין לחייל רכב,הוריו מכניסים פחות מ8,000 לחודש ולחייל 3 אחים קטנים, כיצד יש לפעול במצב זה? `,
                ans1: `להגיד לו שהוא לא רשאי להגשת הבקשה`,
                ans2: `לפתוח לחייל בקשה לתשלומי משפחה, סיוע כלכלי ותווי קניה בחוגר`,
                ans3: `להגיד לו שאין לך איך לעזור לו`,
                ans4: `לפתוח לחייל בקשה להיתר עבודה`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `תוך כמה זמן יש לבצע ביקור בית לחייל שהגיש את הבקשה`,
                ans1: `תוך 30 ימים מפתיחת הבקשה`,
                ans2: `תוך 14 ימים מפתיחת הבקשה`,
                ans3: `תוך 10 ימים מפתיחת הבקשה`,
                ans4: `תוך חודש מפתיחת הבקשה`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `במידה והורי החייל לא מעוניינים לשתף פעולה בהבאת אישורים:`,
                ans1: `יש לבצע שיחה עם ההורים`,
                ans2: `לא צריך להביא אישורים`,
                ans3: `לא ניתן להגיש את הבקשה`,
                ans4: `יש להחתים על כך סא״ל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מהם האישורים הנדרשים לבקשת תשמש`,
                ans1: `ריכוז יתרות של החייל וצילום תעודת זהות של ההורים`,
                ans2: `עוש חודש אחורה של ההורים והחייל`,
                ans3: `לא נדרשים אישורים רק ביקור בית`,
                ans4: `עוש 3 חודשים של ההורים והחייל,פכא 3 חודשים של ההורים והחייל,ריכוז יתרות של ההורים והחייל,תלושי שכר 3 חודשים אחרונים של ההורים,אם יש קצבה מביטוח לאומי,צילום תד+ ספח ילדים של ההורים.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `תשלומי התשמש נכנסים לחשבון של:`,
                ans1: `תשלומי התשמש לא נכנסים לחשבון, מקבלים במזומן`,
                ans2: `כל אחד ממשפחתו של החייל`,
                ans3: `לחשבון ההורה של החייל`,
                ans4: `לחשבון החייל`,
                correctAns: "ans3"
            },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `למה מיועד תשמ״ש?`,
                ans1: `בקשה המיועדת להיתר עבודה פרטי`,
                ans2: `בקשה המיועדת למקום השיבוץ של החייל`,
                ans3: `בקשה המיועדת לעזרה רפואית של החייל`,
                ans4: `בקשה המיועדת לעזרה כלכלית ותמיכה להורי חייל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `החייל עידן ניגש למשקית הת״ש ושיתף אותה במצב המשפחה,שהם נמצאים בחובות לבנק, אין לחייל רכב,הוריו מכניסים פחות מ8,000 לחודש ולחייל 3 אחים קטנים, כיצד יש לפעול במצב זה? `,
                ans1: `להגיד לו שהוא לא רשאי להגשת הבקשה`,
                ans2: `לפתוח לחייל בקשה לתשלומי משפחה, סיוע כלכלי ותווי קניה בחוגר`,
                ans3: `להגיד לו שאין לך איך לעזור לו`,
                ans4: `לפתוח לחייל בקשה להיתר עבודה`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `תוך כמה זמן יש לבצע ביקור בית לחייל שהגיש את הבקשה`,
                ans1: `תוך 30 ימים מפתיחת הבקשה`,
                ans2: `תוך 14 ימים מפתיחת הבקשה`,
                ans3: `תוך 10 ימים מפתיחת הבקשה`,
                ans4: `תוך חודש מפתיחת הבקשה`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `במידה והורי החייל לא מעוניינים לשתף פעולה בהבאת אישורים:`,
                ans1: `יש לבצע שיחה עם ההורים`,
                ans2: `לא צריך להביא אישורים`,
                ans3: `לא ניתן להגיש את הבקשה`,
                ans4: `יש להחתים על כך סא״ל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מהם האישורים הנדרשים לבקשת תשמש`,
                ans1: `ריכוז יתרות של החייל וצילום תעודת זהות של ההורים`,
                ans2: `עוש חודש אחורה של ההורים והחייל`,
                ans3: `לא נדרשים אישורים רק ביקור בית`,
                ans4: `עוש 3 חודשים של ההורים והחייל,פכא 3 חודשים של ההורים והחייל,ריכוז יתרות של ההורים והחייל,תלושי שכר 3 חודשים אחרונים של ההורים,אם יש קצבה מביטוח לאומי,צילום תד+ ספח ילדים של ההורים.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `תשלומי התשמש נכנסים לחשבון של:`,
                ans1: `תשלומי התשמש לא נכנסים לחשבון, מקבלים במזומן`,
                ans2: `כל אחד ממשפחתו של החייל`,
                ans3: `לחשבון ההורה של החייל`,
                ans4: `לחשבון החייל`,
                correctAns: "ans3"
            },
        ],
        "learningContent": {
            // סוג הכרטיסייה
            "הגדרה": {
                "הגדרה": [
                    {
                        cardType: "text",
                        content: `תשמ״ש היא בקשה לתשלומי משפחה, בקשה המיועדת לעזרה כלכלית ותמיכה להורי חייל מין "משכורת" צבאית שנכנסת לחשבון ההורה של החייל.
                        `
                    }
                ]
            },
            "הקריטריונים לבקשה   ": {
                "הקריטריונים לבקשה": [
                    {
                        cardType: "text",
                        content: `לבקשה מס קריטריונים, קיימות מספר שאלות מוכנות שעוזרות להבין האם צריך לפתוח את הבקשה מלכתחילה, השאלות הן:
                        <ul>
                        <li>האם ההורים מכניסים מעל/מתחת ל-8,000 ₪ בחודש?</li>
                        <li>במידה ומתחת האם הם מקבלים השלמת הכנסה / קצבה מבטלא. </li>
                        <li>כמה קטינים יש? (קטין - כל ילד שמתחת לגיל 18 כולל ושאינו בצבא)</li>
                        <li>האם יש רכב? במידה וכן יש לבדוק אם הרכב בשווי של מעל 40,000 לפי מחירון לוי יצחק.</li>
                        <li>האם יש חובות נוספים?  (לא חובה לבקשה אך יעזור)</li>
                        </ul>
                       `
                    }
                ]
            },
            "האישורים הנדרשים": {
                "האישורים הנדרשים": [
                    {
                        cardType: "text",
                        content: `<li>עו"ש 3 חודשים של ההורים והחייל.</li>
                        <li>פכ"א 3 חודשים של ההורים והחייל.</li>
                        <li>ריכוז יתרות של ההורים והחייל!</li>
                        <li>תלושי שכר 3 חודשים אחרונים של ההורים.</li>
                        <li>יש קצב מבטלא אז אישור על כך שלושה חודשים</li>
                        <li>צילום ת"ד + ספח ילדים של ההורים</li>
                        <li>במידה וההורים גרושים פסק דין גרושין</li>
                        <li>במידה ויש רכב רשיון רכב- אישור מחירון יצחק לוי + הצהרת קילומטראז' יש לבצע ביקור בית לחייל 30 יום מפתיחת הבקשה</li>
                       `
                    }
                ]
            },
            "אישורים לסכ תקמ": {
                "אישורים לסכ תקמ": [
                    {
                        cardType: "text",
                        content: `
                            <li>עו"ש 3 חודשים של ההורים והחייל.</li>
                            <li>פכ"א 3 חודשים של ההורים והחייל.</li>
                            <li>ריכוז יתרות של ההורים והחייל.</li> <br>
                        במידה והחייל חייל בודד מובהק אין לדרוש אישור הוריו. <br>
                        במידה והורי החייל לא מעוניינים לשתף פעולה בהבאת אישורים יש להחתים על כך סאל. <br>
                        כאשר פותחים לחייל את הבקשה מחתימים אותו על הצהרה לפתיחת הבקשה - ההצהרה נועדה להחתים את`
                    },
                    {
                        cardType: "text",
                        content: `החייל על כוונתו ורצונו לבקשה ועל שיתוף פעולה של החייל, את ההצהרה מארכבים גם תחת אישורים בבקשה. <br> <br>
                        *יש צורך להביא לחייל אישור להורים שבו הם צריכים לרשום את האשראי הפרטי שלהם ועוד כמה פרטים ולחתום
                        לאחר הבאת כלל האישורים ובדיקה מקיפה כי יש את כל הנדרש.
`
                    }
                ]
            },
            "תהליך פתיחת הבקשה": {
                "תהליך פתיחת הבקשה - סיוע כלכלי": [
                    {
                        cardType: "text",
                        content: `
                        <ol> 
                            <li> פותחים את ה-PA30 </li>
                            <li> כותבים את המספר האישי של החייל או את שמו המלאה בחלונית הלבנה </li>
                            <li> לוחצים על בקשות וכותבים בסוג-400 </li>
                            <li> לוחצים על צור (דף לבן בראש העמוד) </li>
                            <div class="sub-title">מזל טוב, פתחתן את הבקשה!</div>
                            <li> חוזרים אחורה בחץ הירוק, בראש העמודים לוחצים על פעילויות (לשים לב שאתן על אותו החייל) </li>
                            <li> כותבים בסוג 400 ואז לוחצים על סקירה </li>
                            <li> אחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה, מארכבים את המסכמים לכל קטגוריה מהתקיה הספציפית של אותו חייל. </li>
                            <li> כותבות המלצה ומגישות!! </li>
                        <ol>`
                    },
                ],
            },
            "תהליך פתיחת הבקשה סכ": {
                "תהליך פתיחת הבקשה סכ": [
                    {
                        cardType: "text",
                        content: `ותחים את ה-PA30 <br>
                             כותבים את המספר האישי של החייל או את שמו המלאה בחלונית הלבנה, לאחר מכן לוחצים על בקשות וכותבים בסוג-400<br>
                             לוחצים על צור (דף לבן בראש העמוד)<br>
                             ומזל טוב פתחתן את הבקשה! <br>
                             חוזרים אחורה בחץ הירוק בראש העמודים לוחצים על פעילויות (לשים לב שאתן על אותו החייל)<br>
                             כותבים בסוג 400<br>
                             לוחצים על סקירה<br>
                             לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה, מארכבים את המסכמים לכל קטגוריה מהתקיה הספציפית של אותו חייל.<br>
                             כותבות המלצה ומגישות!!
`
                    }
                ]
            }
        },

    },
    "בודד": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 3,
        "questionsExam": [
            {
                type: "multiple",
                question: `בקשת בודד היא:`,
                ans1: `בקשה אשר תספק להוריו של החייל תשלומים`,
                ans2: `בקשה אשר תספק לחייל מקום לישון בו וסיועים כלכליים, אם זה בחגים וגם בשירות השותף`,
                ans3: `בקשה שמטרתה לעודד את החייל`,
                ans4: `בקשה אשר מוציאה את החייל מהצבא`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `איזה סוגים של בודד קיימים?`,
                ans1: `בודד אישי, בודד נשוי`,
                ans2: `בודד ראשון ובודד שני`,
                ans3: `חסר עורף משפחתי, בודד מובהק, בודד בן יורדים`,
                ans4: `אין סוגים של בודד`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האישורים הנדרשים להגשת בקשת בודד הם:`,
                ans1: `ביצוע ביקור בית וצילום תעודת הזהות של החייל ומכתב אישי של החייל`,
                ans2: `לא נדרשים אישורים להגשת בודד`,
                ans3: `צילום הוצאות האשראי של החייל`,
                ans4: `תדפיס עו"ש של החייל,פכ"א של החייל
                ריכוז יתרות של החייל,במידה ולחייל רכב או נכסים – אישור המעיד על כך
                כל אישור שיכול לפרט על מצבו של החייל,מכתב אישי של החייל המפרט את מצבו עם המשפחה והתמיכה הכלכלית בו ,אנשי קשר שהם לא חברים או בני/ות זוג שיעידו על מצבו של החייל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה והחייל לא מתגורר עם אחד מבני משפחתו:`,
                ans1: `לא ניתן לעשות עם זה שום דבר`,
                ans2: `יש לפתוח בקשת בודד שבוע לאחר הגעת החייל למשרד התש `,
                ans3: `יש לפתוח לו באופן מידי הלנה זמנית מיידית ולמצוא לו פתרון דיור מידי.`,
                ans4: `להציע לחייל לישון בבית של אחד החיילים`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `חייל סיפר כי כבר כמה שנים שאינו בקשר עם הוריו ומשפחתו מכיוון שהמשפחה שלו משפחה חרדית והחייל חזר בשאלה והוריו לא קיבלו את זה. ואמרו לו שהם אינם רוצים בקשר עימו האם החייל זכאי להגיש בקשת בודד`,
                ans1: `כן`,
                ans2: `רק אם המשקית תש לא תהיה עמוסה בעבודה`,
                ans3: `לא`,
                ans4: `לא, כחלק מתפקידה של המשקית תש, היא צריכה לדבר עם משפחתו כדי שיחזרו לקשר`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `סוג בקשת הבודד היא:`,
                ans1: `404`,
                ans2: `22`,
                ans3: `401`,
                ans4: `4`,
                correctAns: "ans3"
            },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `בקשת בודד היא:`,
                ans1: `בקשה אשר תספק להוריו של החייל תשלומים`,
                ans2: `בקשה אשר תספק לחייל מקום לישון בו וסיועים כלכליים, אם זה בחגים וגם בשירות השותף`,
                ans3: `בקשה שמטרתה לעודד את החייל`,
                ans4: `בקשה אשר מוציאה את החייל מהצבא`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `איזה סוגים של בודד קיימים?`,
                ans1: `בודד אישי, בודד נשוי`,
                ans2: `בודד ראשון ובודד שני`,
                ans3: `חסר עורף משפחתי, בודד מובהק, בודד בן יורדים`,
                ans4: `אין סוגים של בודד`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האישורים הנדרשים להגשת בקשת בודד הם:`,
                ans1: `ביצוע ביקור בית וצילום תעודת הזהות של החייל ומכתב אישי של החייל`,
                ans2: `לא נדרשים אישורים להגשת בודד`,
                ans3: `צילום הוצאות האשראי של החייל`,
                ans4: `תדפיס עו"ש של החייל,פכ"א של החייל
                ריכוז יתרות של החייל,במידה ולחייל רכב או נכסים – אישור המעיד על כך
                כל אישור שיכול לפרט על מצבו של החייל,מכתב אישי של החייל המפרט את מצבו עם המשפחה והתמיכה הכלכלית בו ,אנשי קשר שהם לא חברים או בני/ות זוג שיעידו על מצבו של החייל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה והחייל לא מתגורר עם אחד מבני משפחתו:`,
                ans1: `לא ניתן לעשות עם זה שום דבר`,
                ans2: `יש לפתוח בקשת בודד שבוע לאחר הגעת החייל למשרד התש `,
                ans3: `יש לפתוח לו באופן מידי הלנה זמנית מיידית ולמצוא לו פתרון דיור מידי.`,
                ans4: `להציע לחייל לישון בבית של אחד החיילים`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `חייל סיפר כי כבר כמה שנים שאינו בקשר עם הוריו ומשפחתו מכיוון שהמשפחה שלו משפחה חרדית והחייל חזר בשאלה והוריו לא קיבלו את זה. ואמרו לו שהם אינם רוצים בקשר עימו האם החייל זכאי להגיש בקשת בודד`,
                ans1: `כן`,
                ans2: `רק אם המשקית תש לא תהיה עמוסה בעבודה`,
                ans3: `לא`,
                ans4: `לא, כחלק מתפקידה של המשקית תש, היא צריכה לדבר עם משפחתו כדי שיחזרו לקשר`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `סוג בקשת הבודד היא:`,
                ans1: `404`,
                ans2: `22`,
                ans3: `401`,
                ans4: `4`,
                correctAns: "ans3"
            },
        ],
        "learningContent": {
            // סוג הכרטיסייה
            "בקשת בודד": {
                "בקשת בודד": [
                    {
                        cardType: "text",
                        content: `קצת על הבקשה -בקשת בודד זה אומר שהצבא יספק לחייל מקום לישון בו וסיועים כלכליים, אם זה בחגים וגם בשירות השותף`
                    },
                ],
                "סוגים של בודד": [
                    {
                        cardType: "text",
                        content: `לבודד יש מספר סוגים: 
                    <li> חסר עורף משפחתי- כאשר החייל לא בקשר עם הוריו מסיבה כזו או אחרת אך הם עדיין חיים ומתגוררים בבית</li>
                    <li> בודד מובהק, בודד בן יורדים- כאשר הורי החייל מתגוררים בחו"ל.
                    בד״כ בודד מובהק ובן יורדים מגלים עוד בזמן המלשביות של החייל והוא יהיה כבר מוכר להטבה. </li>
                   `
                    },],
            },
            "השלבים לבקשת בודד": {
                "השלבים לבקשת בודד": [
                    {
                        cardType: "text",
                        content: `לבקשת בודד יש כמה שלבים:
                        <ol>
                        <li> לקיחת אישורים כלכליים ומספרי טל של אנשי קשר. </li>
                        <li>דוחות שיחה ותיעודם, 
                            <strong>טיפ: </strong>
                            להקליט את השיחה ולאחר מכן לשכתב אותה מילה במילה. <br>
                        בנוסף כאשר מתחילים את השיחה לעולם לא אפרט למה אני מתקשרת אלא אסביר כי אני המשקית תש ואני רוצה לשפר את תנאי החייל, לעולם לא ללחוץ על אנשים שלא משתפים פעולה! חוסר שיתוף פעולה / ניתוק יש לתעד, לא כולם ישתפו איתכם פעולה ויהיו שיחות קשות
                        ומורכבות - לשמור על קור רוח. </li>
                        <li>ראיון של הקצינה עם החייל</li>
                        <li>הגשת הבקשה!</li>
                        </ol>
                        <strong>טיפ: </strong> לעולם לא להבטיח לחייל שהבקשה תאושר, אין לדעת מה תהיה התשובה
                       
                       `
                    },
                ],
            },
            "אישורים לבודד חע\"מ": {
                "אישורים לבודד חע\"מ": [
                    {
                        cardType: "text",
                        content: `<li>תדפיס עו"ש של החייל 3 חודשים אחרונים</li>
                        <li>פכ"א של החייל 3 חודשים אחרונים</li>
                        <li>ריכוז יתרות של החייל</li>
                        <li>במידה ולחייל רכב או נכסים – אישור המעיד על כך.</li>
                        <li>כל אישור שיכול לפרט על מצבו של החייל ( אישור מפנימייה, משפחת אומנה, עובדת סוציאלית , רווחה(</li>
                        <li>מכתב אישי של החייל המפרט את מצבו עם המשפחה והתמיכה הכלכלית בו.</li>
                        <li>7 אנשי קשר שהם לא חברים או בני/ות זוג שיעידו על מצבו של החייל . (הורים, אחים,בני דודים/ות, מדריך בפנימייה,מורה בביהס שכנים, סבא /סבתא, רב).</li>
                        <li>יש לבצע ביקור בית לחייל 30 יום מפתיחת הבקשה</li>
                        <li>במידה והחייל לא מתגורר עם אחד מבני משפחתו יש לפתוח לו באופן מידי הלנה זמנית מיידית ולמצוא לו פתרון דיור מידי.</li>
                       `
                    }
                ]
            },
            "אישורים לבודד חעמ": {
                "אישורים לבודד חעמ": [
                    {
                        cardType: "text",
                        content: `*תדפיס עו"ש של החייל 3 חודשים אחרונים<br>
                        *פכ"א של החייל 3 חודשים אחרונים<br>
                        *ריכוז יתרות של החייל<br>
                        במידה ולחייל רכב או נכסים – אישור המעיד על כך<br>
                        כל אישור שיכול לפרט על מצבו של החייל ( אישור מפנימייה, משפחת אומנה, עובדת סוציאלית , רווחה)<br>
                        *מכתב אישי של החייל המפרט את מצבו עם המשפחה והתמיכה הכלכלית בו .<br>
                        *7 אנשי קשר שהם לא חברים או בני/ות זוג שיעידו על מצבו של החייל . (הורים, אחים,בני דודים/ות, מדריך בפנימייה,מורה בביהס שכנים, סבא /סבתא, רב).<br>
                        יש לבצע ביקור בית לחייל 30 יום מפתיחת הבקשה<br>
                        במידה והחייל לא מתגורר עם אחד מבני משפחתו יש לפתוח לו באופן מידי הלנה זמנית מיידית ולמצוא לו פתרון דיור מידי.<br>
                       `
                    },
                ],
            },
            "פתיחת הבקשה": {
                "פתיחת הבקשה": [
                    {
                        cardType: "text",
                        content: `פותחים את ה PA30
                        כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה. <br>
                        לאחר מכן לוחצים על בקשות. <br>
                        כותבים בסוג 401,לוחצים אנטר ,כותבים בסוג 401,לוחצים אנטר. <br>
                       לוחצים על צור ומזל טוב פתחתן את הבקשהה! <br>
                        חוזרים אחורה בחץ הירוק בראש העמוד <br>
                        לוחצים על פעילויות (לשים לב שאתן על אותו החייל),כותבים בסוג 401,לוחצים על סקירה<br>
                        לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה. אחרי שאירכבתן את האישורים תעלה לכן המלצה בשולחן העבודה. מארכבים את המסכמים לכל קטגוריה. כותבות המלצה ומגישות. ק.התייש מבצעת ראיון אישי לחייל ומעלה את הבקשה לתא בודדים.`
                    },
                ],
            },
        },
    },
    "סיוע כלכלי": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 3,
        "questionsExam": [
            {
                type: "multiple",
                question: `כיצד סיוע כלכלי בא לידי ביטוי?`,
                ans1: `בכך שהוא מוריד מהחייל עבודה בזמן שהוא נמצא בבסיס `,
                ans2: `בהוספת ימי חופש לחייל שיוכל לעבוד`,
                ans3: `בכך שהמשקית תש יכולה לעזור מכספה לחייל`,
                ans4: `במענק במשכורת (בדכ חדפ) ובתווי קניה מתמשך - תווים בחוגר המשמשים, לקניה ברשתות של סופרים, שקם וכו`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `חייל ניגש אלי וסיפר לי כי אינו נתמך כלכלית בהוריו ולאחרונה הוא לא מצליח לסגור את החודש, הוא בין מינוס למינוס, ויש לי היתר עבודה פרטי,הוא עובד בסופשים ועושה הכל ועדיין יש לו קושי כלכלי גדול שלא מצליח להתגבר עליו.
                מה עליי לעשות?`,
                ans1: `לא ניתן לעשות כלום בנידון`,
                ans2: `להבטיח לחייל שיקבל מענק`,
                ans3: `לפתוח לחייל בקשה ולבקש את האישורים הנדרשים`,
                ans4: `אם יש באפשרותי, אתרום לחייל מכספי האישי כדי לעזור לו`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האם האישורים של בקשת סיוע כלכלי תקפים גם לתווי קניה`,
                ans1: `לא`,
                ans2: `לא צריך אישורים לתווי קנייה`,
                ans3: `כן`,
                ans4: `רק חלק מהאישורים`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `איזה אישורים נדרשים לבקשת סיוע כלכלי`,
                ans1: `עוש של הוריו של החייל חודש אחורה`,
                ans2: `עוש של החייל שנה אחורה`,
                ans3: `צילום הבית של החייל`,
                ans4: `עוש 3 חודשים של ההורים והחייל,פכא 3 חודשים של ההורים והחייל, ריכוז יתרות של ההורים והחייל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מה ניתן לעשות כאשר הורי החייל לא מעוניינים לשתף פעולה בהבאת האישורים`,
                ans1: `יש להחתים את מפקדו הישיר של החייל`,
                ans2: `יש להחתים על כך סא״ל`,
                ans3: `לנסות לדבר עם ההורים`,
                ans4: `אין מה לעשות, אי אפשר ללחוץ עליהם`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `האם משקית התש של החייל מחליטה כמה כסף הוא יקבל אם הבקשה תאושר?`,
                ans1: `כן, בייעוץ הוריו של החייל`,
                ans2: `רק אם היא מכירה את החייל מהחיים האישיים`,
                ans3: `לא, זה לא לשיקול הדעת שלה`,
                ans4: `כן, היא מכירה אותו הכי טוב`,
                correctAns: "ans3"
            },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `כיצד סיוע כלכלי בא לידי ביטוי?`,
                ans1: `בכך שהוא מוריד מהחייל עבודה בזמן שהוא נמצא בבסיס `,
                ans2: `בהוספת ימי חופש לחייל שיוכל לעבוד`,
                ans3: `בכך שהמשקית תש יכולה לעזור מכספה לחייל`,
                ans4: `במענק במשכורת (בדכ חדפ) ובתווי קניה מתמשך - תווים בחוגר המשמשים, לקניה ברשתות של סופרים, שקם וכו`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `חייל ניגש אלי וסיפר לי כי אינו נתמך כלכלית בהוריו ולאחרונה הוא לא מצליח לסגור את החודש, הוא בין מינוס למינוס, ויש לי היתר עבודה פרטי,הוא עובד בסופשים ועושה הכל ועדיין יש לו קושי כלכלי גדול שלא מצליח להתגבר עליו.
                מה עליי לעשות?`,
                ans1: `לא ניתן לעשות כלום בנידון`,
                ans2: `להבטיח לחייל שיקבל מענק`,
                ans3: `לפתוח לחייל בקשה ולבקש את האישורים הנדרשים`,
                ans4: `אם יש באפשרותי, אתרום לחייל מכספי האישי כדי לעזור לו`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `האם האישורים של בקשת סיוע כלכלי תקפים גם לתווי קניה`,
                ans1: `לא`,
                ans2: `לא צריך אישורים לתווי קנייה`,
                ans3: `כן`,
                ans4: `רק חלק מהאישורים`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `איזה אישורים נדרשים לבקשת סיוע כלכלי`,
                ans1: `עוש של הוריו של החייל חודש אחורה`,
                ans2: `עוש של החייל שנה אחורה`,
                ans3: `צילום הבית של החייל`,
                ans4: `עוש 3 חודשים של ההורים והחייל,פכא 3 חודשים של ההורים והחייל, ריכוז יתרות של ההורים והחייל`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מה ניתן לעשות כאשר הורי החייל לא מעוניינים לשתף פעולה בהבאת האישורים`,
                ans1: `יש להחתים את מפקדו הישיר של החייל`,
                ans2: `יש להחתים על כך סא״ל`,
                ans3: `לנסות לדבר עם ההורים`,
                ans4: `אין מה לעשות, אי אפשר ללחוץ עליהם`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `האם משקית התש של החייל מחליטה כמה כסף הוא יקבל אם הבקשה תאושר?`,
                ans1: `כן, בייעוץ הוריו של החייל`,
                ans2: `רק אם היא מכירה את החייל מהחיים האישיים`,
                ans3: `לא, זה לא לשיקול הדעת שלה`,
                ans4: `כן, היא מכירה אותו הכי טוב`,
                correctAns: "ans3"
            },
        ],
        "learningContent": {
            "הגדרה": {
                "הגדרה": [
                    {
                        cardType: "text",
                        content: `סיוע כלכלי הוא הפיתרון הפשוט ביותר שניתן להציע לחייל. הוא פיתרון נוח וטוב. סיוע כלכלי מתבטא במענק במשכורת (בדכ חדפ) ובתווי קניה מתמשך - תווים בחוגר המשמשים, לקניה ברשתות של סופרים, שקם וכו. <br>
                            כאשר פותחים לחייל סיוע כלכלי אגיש לו גם מענק וגם תווי קניה מתמשך . האישורים הנדרשים הם אותם אישורים לשתי הבקשות . <br>
                            טיפ-לעולם לא להבטיח לחייל שיאושר לו, אין לדעת מה יאושר וכמה. זה לא לשיקול הדעת שלכם. תווי קניה מתמשך ניתן לחדש. בדכ יהיה אפשר לחדש על פי חידוש על סמך ניצול או שיחודש על פי אישורים מחודשים. זה תלוי בשיקול דעת הקצינה. <br>
                           `
                    },
                ],
            },
            "האישורים הנדרשים": {
                "האישורים הנדרשים": [
                    {
                        cardType: "text",
                        content: `עוש 3 חודשים של ההורים והחייל. <br>
                                    פכא 3 חודשים של ההורים והחייל. <br>
                                    ריכוז יתרות של ההורים והחייל. <br>
                                    האישורים תקפים גם לסיוע כלכלי וגם לתווי קניה. <br>
                                    במידה והוריי החייל לא מעוניינים לשתף פעולה בהבאת אישורים יש להחתים על כך סאלי<br>
                                    לאחר קבלת האישורים אני סורקת אותם<br>
                                    יש לסרוק את אישוריי החייל מראש, בעת סריקת המסמכים לשמור את המסמכים בשמם ובנפרד בתקיה שאת יוצרת לחייל. בעת הארכוב יקח לכם/ן יותר מהר ויותר קל<br>
                                   `
                    },
                ],
            },
            "פתיחת הבקשה(תקמ)": {
                "פתיחת הבקשה תקמ": [
                    {
                        cardType: "text",
                        content: `לצלם את מסך המחשב .פותחים את ה PA30<br>
                                    כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה. לאחר מכן לוחצים על בקשות. כותבים בסוג 428.לוחצים על צור (דף לבן בראש העמוד),מזל טוב פתחתן את הבקשה!<br>
                                   חוזרים אחורה בחץ הירוק בראש העמוד,לוחצים על פעילויות ,כותבים בסוג 428 ולוחצים על סקירה (שני הרים עם שמש)לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה. <br>
                                    מארכבים את המסמכים לכל קטגוריה. אחרי שאירכבתן את האישורים תעלה לכן המלצה בשולחן העבודה.<br>
                                   כותבים בסוג 428 ולוחצים על סקירה כותבות המלצה ומגישות.
                                   `
                    },
                ],
            },
            "תהליך פתיחת הבקשה סכ": {
                "תהליך פתיחת הבקשה סכ": [
                    {
                        cardType: "text",
                        content: `פותחים את ה PA30
                        כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה.<br>
                        לאחר מכן לוחצים על בקשות. כותבים בסוג 404.<br>
                        לוחצים על צור (דף לבן בראש העמוד),מזל טוב פתחתן את הבקשה!<br>
                        חוזרים אחורה בחץ הירוק בראש העמוד, לוחצים על פעילויות (לשים לב שאתן על אותו החייל)כותבים בסוג 404. לוחצים על סקירה (שני הרים עם שמש)<br>
                         לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה.<br>
                         מארכבים את המסכמים לכל קטגוריה. כותבות המלצה ומגישות<br>
                         אחרי שאירכבתן את האישורים תעלה לכן המלצה בשולחן העבודה.
                        `
                    },
                ]

            },
        }
    },
    "היתר עבודה פרטי": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 6,
        "questionsExam": [
            {
                type: "multiple",
                question: `מהו היתר עבודה פרטי?`,
                ans1: `היתר שבו החייל יעבוד עם מדים`,
                ans2: `היתר שבו החייל יעבוד גם בזמן שהותן בבסיס`,
                ans3: `היתר עבודה פרטי היא בקשה המיועדת לחיילים העובדים מחוץ לשעות הצבא`,
                ans4: `היתר שבו החייל יכול לעבוד עם נשק עליו`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `את מי צריך להחתים להיתר עבודה פרטית`,
                ans1: `את מפקדו הישיר בלבד`,
                ans2: `אין צורך להחתים כדי לקבל היתר עבודה פרטית `,
                ans3: `את הוריו של החייל`,
                ans4: `צריך להחתים את המעסיק של החייל עם פרטי העסק ופרטי העבודה, לאחר מכן יש לאשר את העבודה מול דרגת סאל ומעלה `,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה וקורה משהו בשעות העבודה לאחר שאושר לחייל היתר עבודה פרטית:`,
                ans1: `מקום העבודה אחראי על החייל`,
                ans2: `הצבא יממן חלק מהנזקים של החייל`,
                ans3: `הצבא לא אחראי על החייל`,
                ans4: `הצבא יוכל לבטח אותו מבחינה רפואית`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה והוריו של החייל לא מעוניינים לשתף פעולה עם הבאת האישורים:`,
                ans1: `החייל ינסה להשיג אישור מקרוב משפחה`,
                ans2: `יש להחתים את החייל בחוסר שתפ של הוריו, ולהגיש ללא אישורים כלכליים של ההורים`,
                ans3: `יש לדבר עם הוריו של החייל`,
                ans4: `לא ניתן להגיש את הבקשה`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `איזה סוג בקשה זה היתר עבודה פרטית?`,
                ans1: `401`,
                ans2: `768`,
                ans3: `462`,
                ans4: `67`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `אילו אישורים נדרשים להגשת הבקשה`,
                ans1: `עובר ושב של החייל ושל הוריו`,
                ans2: `מכתב אישי של החייל`,
                ans3: `אישור מעסיק חתום,עוש 3 חודשים של ההורים והחייל,פכא 3 חודשים של ההורים והחייל,ריכוז יתרות של ההורים והחייל`,
                ans4: `לא נדרש אישורים, רק ביקור בית`,
                correctAns: "ans3"
            },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `מהו היתר עבודה פרטי?`,
                ans1: `היתר שבו החייל יעבוד עם מדים`,
                ans2: `היתר שבו החייל יעבוד גם בזמן שהותן בבסיס`,
                ans3: `היתר עבודה פרטי היא בקשה המיועדת לחיילים העובדים מחוץ לשעות הצבא`,
                ans4: `היתר שבו החייל יכול לעבוד עם נשק עליו`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `את מי צריך להחתים להיתר עבודה פרטית`,
                ans1: `את מפקדו הישיר בלבד`,
                ans2: `אין צורך להחתים כדי לקבל היתר עבודה פרטית `,
                ans3: `את הוריו של החייל`,
                ans4: `צריך להחתים את המעסיק של החייל עם פרטי העסק ופרטי העבודה, לאחר מכן יש לאשר את העבודה מול דרגת סאל ומעלה `,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה וקורה משהו בשעות העבודה לאחר שאושר לחייל היתר עבודה פרטית:`,
                ans1: `מקום העבודה אחראי על החייל`,
                ans2: `הצבא יממן חלק מהנזקים של החייל`,
                ans3: `הצבא לא אחראי על החייל`,
                ans4: `הצבא יוכל לבטח אותו מבחינה רפואית`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה והוריו של החייל לא מעוניינים לשתף פעולה עם הבאת האישורים:`,
                ans1: `החייל ינסה להשיג אישור מקרוב משפחה`,
                ans2: `יש להחתים את החייל בחוסר שתפ של הוריו, ולהגיש ללא אישורים כלכליים של ההורים`,
                ans3: `יש לדבר עם הוריו של החייל`,
                ans4: `לא ניתן להגיש את הבקשה`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `איזה סוג בקשה זה היתר עבודה פרטית?`,
                ans1: `401`,
                ans2: `768`,
                ans3: `462`,
                ans4: `67`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `אילו אישורים נדרשים להגשת הבקשה`,
                ans1: `עובר ושב של החייל ושל הוריו`,
                ans2: `מכתב אישי של החייל`,
                ans3: `אישור מעסיק חתום,עוש 3 חודשים של ההורים והחייל,פכא 3 חודשים של ההורים והחייל,ריכוז יתרות של ההורים והחייל`,
                ans4: `לא נדרש אישורים, רק ביקור בית`,
                correctAns: "ans3"
            },
        ],
        "learningContent": {
            // סוג הכרטיסייה
            "הגדרה": {
                "הגדרה": [
                    {
                        cardType: "text",
                        content: `היתר עבודה פרטי היא בקשה המיועדת לחיילים העובדים מחוץ לשעות הצבא, בדר״כ תפגשו את זה עם חיילים שעובדים משמרות כמו טבחים - שבוע שבוע וכו.<br>
                        היתר עבודה פרטי הוא הביטוח של החייל מהצבא, במידה ולחייל יקרה משהו בשעות העבודה הצבא יוכל לבטח אותו מבחינה רפואית . חייל לא יכול לעבוד בלי היתר עבודה פרטי.<br>
                        להיתר עבודה צריך להחתים את המעסיק של החייל עם פרטי העסק ופרטי העבודה, לאחר מכן יש לאשר את העבודה מול דרגת סאל ומעלה .
                        `
                    }
                ]
            },
            "אישורים נדרשים": {
                "אישורים נדרשים": [
                    {
                        cardType: "text",
                        content: `אישורים להיתר עבודה פרטי: <br>
                        אישור מעסיק חתום<br>
                        עוש 3 חודשים של ההורים והחייל.<br>
                        פכא 3 חודשים של ההורים והחייל.<br>
                        ריכוז יתרות של ההורים והחייל.<br>
                        לאחר שקיבלתי את האישורים ואת האישור מעסיק אני אחתים דרגת סאל על האישור מעסיק. אסרוק את האישורים - טיפ - יש לסרוק את אישוריי החייל מראש , בעת סריקת המסמכים לשמור את המסמכים בשמם ובנפרד בתקיה שאת יוצרת לחייל. בעת הארכוב יקח לכם/ן יותר מהר ויותר קל.
                        `
                    },
                ],
            },
            "פתיחת הבקשה": {
                "פתיחת הבקשה": [
                    {
                        cardType: "text",
                        content: `פותחים את הPA30<br>
                        כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה.<br>
                        לאחר מכן לוחצים על בקשות. כותבים בסוג 462.<br>
                        לוחצים על צור (דף לבן בראש העמוד)מזל טובב פתחתן את הבקשהה!<br>
                        חוזרים אחורה בחץ הירוק בראש העמוד<br>
                        לוחצים על פעילויות (לשים לב שאתן על אותו חייל) כותבים בסוג 462. ולוחצים על סקירה (שני הרים עם שמש).לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה.מארכבים את המסכמים לכל קטגוריה. <br>
                        אחרי שאירכבתן את האישורים תעלה לכן המלצה בשולחן העבודה.<br>
                        כותבות המלצה ומגישות.
                       `
                    },
                ],
            },
            "דגשים": {
                "דגשים": [
                    {
                        cardType: "text",
                        content: `*אם החייל לא ברמת פעילות א+ יש לדרוש ממנו אישורים כלכליים שלו ושל הוריו. במידה והוריו לא משתפים פעולה יש להחתים את החייל בחוסר שתפ של הוריו, ולהגיש ללא אישורים כלכליים של ההורים .<br>
                        *להסביר לחייל שאת כל האישורים ניתן להוציא מהאפליקציה של הבנק ובנוסף אם צריך כל עזרה אתן פה למענן<br>
                         במידה והורי החייל לא מעוניינים לשתף פעולה יש להחתים על כך סא״ל<br>
                         במידה ובסיסכם ברמת פעילות א+ אין צורך באישורים כלכליים של החייל והוריו.
                        `
                    },
                ],
            },
            // "": {
            //     "": [
            //         {
            //             cardType: "text",
            //             content: `<pre></pre>`
            //         },
            //     ],
            // },
        },
    },
    "חופשה מיוחדת": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 6,
        "questionsExam": [
            {
                type: "multiple",
                question: `איזה סוגים יש של חופשה מיוחדת`,
                ans1: `מיוחדת לחופשה`,
                ans2: `אישית וכלכלית`,
                ans3: `נפשית`,
                ans4: `מיוחדת חתונה`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מול מי צריך לאשר חופשה מיוחדת? `,
                ans1: `מול דרגת סגן בלבד`,
                ans2: `מול קצינת התש בלבד`,
                ans3: `מול מפקד החייל בדרגת מפ ומול דרגת סאל`,
                ans4: `מול דרגת רסן ומעלה`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `מה צריך כדי לצאת לחופשה מיוחדת כלכלית?`,
                ans1: `כל התשובות נכונות`,
                ans2: `אפשר לצאת למיוחדת כלכלית בלי צורך לשום מסמך`,
                ans3: `צילום תעודת זהות של ההורים`,
                ans4: `היתר עבודה פרטי בתוקף`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `איזה אישורים נדרשים לבקשה`,
                ans1: `לא נדרשים אישורים לבקשה זו, רק ביקור בית אצל החייל`,
                ans2: `מכתב שבו החייל מצהיר כי מוותר על ימי החופש שלו`,
                ans3: `אישור של מפקדו הישיר של החייל`,
                ans4: `מכתב אישי של החייל ,הצהרת סאל המאשר את המיוחדת.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה וזו מיוחדת ראשונה של החייל:`,
                ans1: `יש צורך להוריד ימי חופש`,
                ans2: `יש להוציאו לשלושה ימים בלבד`,
                ans3: `יש ללכת למשרד השלישות כדי שיאשרו את המיוחדת`,
                ans4: `יש להוציאו לעשרה ימים`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `איזה סוג בקשה זו?`,
                ans1: `01`,
                ans2: `459`,
                ans3: `28`,
                ans4: `787`,
                correctAns: "ans2"
            },
            // {
            //     type: "multiple",
            //     question: ``,
            //     ans1: ``,
            //     ans2: ``,
            //     ans3: ``,
            //     ans4: ``,
            //     correctAns: "ans"
            // },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `איזה סוגים יש של חופשה מיוחדת`,
                ans1: `מיוחדת לחופשה`,
                ans2: `אישית וכלכלית`,
                ans3: `נפשית`,
                ans4: `מיוחדת חתונה`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מול מי צריך לאשר חופשה מיוחדת? `,
                ans1: `מול דרגת סגן בלבד`,
                ans2: `מול קצינת התש בלבד`,
                ans3: `מול מפקד החייל בדרגת מפ ומול דרגת סאל`,
                ans4: `מול דרגת רסן ומעלה`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `מה צריך כדי לצאת לחופשה מיוחדת כלכלית?`,
                ans1: `כל התשובות נכונות`,
                ans2: `אפשר לצאת למיוחדת כלכלית בלי צורך לשום מסמך`,
                ans3: `צילום תעודת זהות של ההורים`,
                ans4: `היתר עבודה פרטי בתוקף`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `איזה אישורים נדרשים לבקשה`,
                ans1: `לא נדרשים אישורים לבקשה זו, רק ביקור בית אצל החייל`,
                ans2: `מכתב שבו החייל מצהיר כי מוותר על ימי החופש שלו`,
                ans3: `אישור של מפקדו הישיר של החייל`,
                ans4: `מכתב אישי של החייל ,הצהרת סאל המאשר את המיוחדת.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה וזו מיוחדת ראשונה של החייל:`,
                ans1: `יש צורך להוריד ימי חופש`,
                ans2: `יש להוציאו לשלושה ימים בלבד`,
                ans3: `יש ללכת למשרד השלישות כדי שיאשרו את המיוחדת`,
                ans4: `יש להוציאו לעשרה ימים`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `איזה סוג בקשה זו?`,
                ans1: `01`,
                ans2: `459`,
                ans3: `28`,
                ans4: `787`,
                correctAns: "ans2"
            },
        ],
        "learningContent": {
            "הגדרה": {
                "הגדרה": [
                    {
                        cardType: "text",
                        content: `לחופשה מיוחדת שהיא דרך משרד התש יש שתי סוגים - אישית וכלכלית.<br>
                        חופשה מיוחדת הינה פיתרון טוב להמון סיטואציות שחיילים יפגשו.<br>
                        חופשה מיוחדת תמיד תאשרו מול מפקד החייל בדרגת מפ ומול דרגת סאל- לא לחפף זה חשוב מאוד!!<br>
                        לחופשה כלכלית תמיד תצטרכו היתר עבודה - לעולם לא להוציא חייל למיוחדת כלכלית בלי היתר עבודה, אל תיקחו את האחריות על עצמכם במידה ויקרה משהו לחייל.  תמיד תזכרו שההיתר הוא הביטוח ובלי זה החייל לא מבוטח וזה אחריות שלכם בלבד!!! 
                       `
                    },
                ],
            },
            "דגשים": {
                "דגשים": [
                    {
                        cardType: "text",
                        content: `*תמיד להמליץ ​​לחייל לדבר עם המפקד האישי ועם המפ שלו מראש .<br>
                        *לוודא את האישור של המפקדים שלו ולתאם מול המפ של החייל את מספר הימים שהוא מאשר לחייל להיות במיוחדת.<br>
                        *בלי אישור סאל אין להוציאו!<br>
                        *במידה וזו מיוחדת ראשונה של חייל יש צורך להוריד לו ימי חופש, אם יוצא למעל חמישה ימים מורידים חמישה ימי חופש, אם מתחת אז רק לפי מס הימים שיוצאים.  לדוגמא החייל יוצא לשלושה ימים אז ירד לו רק שלושה ימים.<br>
                        *יש להחתים את החייל על ההצהרה לפתיחת בקשה למקרה שאם ירצה להשאר יותר מ-14 ימים בחופשה.<br>
                        *תמיד ליידע את השלישות על המיוחדת שחייל יוצא אליה . לאיזה סוג יוצא, מס הימים שיוצא ואת התאריכים המדוייקים.
                       `
                    },
                ],
            },
            "אישורים נדרשים": {
                "אישורים נדרשים": [
                    {
                        cardType: "text",
                        content: `מכתב אישי של החייל<br>
                        הצהרת סאל המאשר את המיוחדת. <br>
                        לאחר קבלת כל האשורים אני סורקת את כל האישורים.<br>
                        יש לסרוק את אישורי החייל מראשו בעת סריקת המסמכים לשמור את המסמכים בשמם<br>
                        ובנפרד בתקיה שאת יוצרת לחייל. בעת הארכוב יקח לכם/ן יותר מהר ויותר קל.
                       `
                    },
                ],
            },
            "פתיחת הבקשה": {
                "פתיחת הבקשה": [
                    {
                        cardType: "text",
                        content: ` יש לצלם את המסך כדי להראות את האופן פתיחת הבקשה<br>
                        פותחים את הPA30, כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה.<br>
                        לאחר מכן לוחצים על בקשות. ,כותבים בסוג 459.<br>
                        לוחצים על צור (דף לבן בראש העמוד)מזל טובב פתחתן את הבקשהה!<br>
                        חוזרים אחורה בחץ הירוק בראש העמוד<br>
                        לוחצים על פעילויות (לשים לב שאתן על אותו החייל)כותבים בסוג 459.ולוחצים על סקירה (שני הרים עם שמש).לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה. מארכבים את המסמכים לכל קטגוריה <br>
                        לאחר קבלת כל האשורים אני סורקת את כל האישורים.<br>
                        לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה מארכבים את המסכמים לכל קטגוריה. <br>
                        אחרי שאירכבתן את האישורים תעלה לכן המלצה בשולחן העבודה. כותבות המלצה, ומזינות במערכת את מס הימים ואת תאריכי החופשה.
                       `
                    },
                ],
            },
            // "": {
            //     "": [
            //         {
            //             cardType: "text",
            //             content: `<pre></pre>`
            //         },
            //     ],
            // },
        },
    },
    "פתרונות דיור": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 4,
        "questionsExam": [
            {
                type: "multiple",
                question: `מהי בקשת פתרונות דיור?`,
                ans1: `כל התשובות נכונות`,
                ans2: `בקשה מעניקה לחייל מספר ימי חופש`,
                ans3: `בקשה אשר כל חייל רשאי לנסות להגיש`,
                ans4: `פתרונות דיור זוהי בקשה הנוגעת לחיילים בודדים ונשואים ומקרים חריגים`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מהי דירת אל״ח?`,
                ans1: `דירה אשר משפחתו של החייל גרים בה`,
                ans2: `דירה אשר כל חייל רשאי לקבל`,
                ans3: `לחיילים בודדים ישנה אפשרות לגור בדירות שנשכרו על-ידי צה"ל בסיוע האגודה למען החייל.`,
                ans4: `בית החייל מימן את שכר הדירה של דירת אל״ח`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `מי צריך לדאוג בבקשה זו לאישורים?`,
                ans1: `המשקית תש בעצמה`,
                ans2: `החייל`,
                ans3: `מפקדו הישיר של החייל`,
                ans4: `קצינת התש`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `אילו אישורים נדרשים לבקשה זו?`,
                ans1: `המלצה של דרגת רסן ומעלה`,
                ans2: `עובר ושב של החייל ושל הוריו`,
                ans3: `מכתב אישי של החייל`,
                ans4: `נגררת תלונות,המלצת מפקד
                ביטול הטבה קודמת אם קיימת`,
                correctAns: "ans4"
            },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `מהי בקשת פתרונות דיור`,
                ans1: `כל התשובות נכונות`,
                ans2: `בקשה מעניקה לחייל מספר ימי חופש`,
                ans3: `בקשה אשר כל חייל רשאי לנסות להגיש`,
                ans4: `פתרונות דיור זוהי בקשה הנוגעת לחיילים בודדים ונשואים ומקרים חריגים`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מהי דירת אל״ח?`,
                ans1: `דירה אשר משפחתו של החייל גרים בה`,
                ans2: `דירה אשר כל חייל רשאי לקבל`,
                ans3: `לחיילים בודדים ישנה אפשרות לגור בדירות שנשכרו על-ידי צה"ל בסיוע האגודה למען החייל.`,
                ans4: `בית החייל מימן את שכר הדירה של דירת אל״ח`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `מי צריך לדאוג בבקשה זו לאישורים?`,
                ans1: `המשקית תש בעצמה`,
                ans2: `החייל`,
                ans3: `מפקדו הישיר של החייל`,
                ans4: `קצינת התש`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: `אילו אישורים נדרשים לבקשה זו?`,
                ans1: `המלצה של דרגת רסן ומעלה`,
                ans2: `עובר ושב של החייל ושל הוריו`,
                ans3: `מכתב אישי של החייל`,
                ans4: `נגררת תלונות,המלצת מפקד
                ביטול הטבה קודמת אם קיימת`,
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            // סוג הכרטיסייה
            "פתרונות דיור": {
                "הגדרה": {
                    "הגדרה": [
                        {
                            cardType: "text",
                            content: `פתרונות דיור זוהי בקשה הנוגעת לחיילים בודדים ונשואים ומקרים חריגים.`
                        },
                    ],
                },
                "אישורים נדרשים": {
                    "אישורים נדרשים": [
                        {
                            cardType: "text",
                            content: `לבקשה זו המשקית תש דורשת מהחייל אישורים אלא מוציאה בעצמה<br>
                            נגררת תלונות<br>
                            המלצת מפקד<br>
                            ביטול הטבה קודמת אם קיימת!<br>
                            לאחר שאספה את כלל האישורים וההצהרות יש לסרוק את הכל<br>
                            יש לסרוק את אישורי החייל מראש! בעת סריקת המסמכים לשכור את המסמכים בשמם. <br>
                            ובנפרד בתקיה שאת יוצרת לחייל. בעת הארכוב יקח לכם/ן יותר מהר ויותר קל<br>
                            לאחר הסריקה יש לבטל את הבקשה הקיימת של החייל. ללא ביטול אין אפשרות להגיש את הבקשה
                            `
                        },
                    ],
                },
                "תהליך ביטול הבקשה הקודמת": {
                    "תהליך ביטול הבקשה הקודמת": [
                        {
                            cardType: "text",
                            content: `ש לצלם את המסך כדי להראות את האופן פתיחת הבקשה<br>
                            פותחים את הPA30<br>
                            כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה.<br>
                            לאחר מכן לוחצים על הבקשות. כותבים בסוג 479.<br>
                             לוחצים על צור (דף לבן בראש העמוד) וממלאים את הפרטים שצריך (תאריך פתיחת הבקשה וסוף<br>
                             הבקשה, מדוע מבטלים)<br>
                             לאחר מכן תעלה לכן המלצה בשולחן עבודה, תכחנו המלצה ותגישו<br>
                             <br>
                            לאחר שהבקשה לביטול אושרה, יש להגיש את הבקשה של ההטבה החדשה (דירת אל"ח)
                            `
                        },
                    ],
                },
                "תהליך פתיחת בקשה חדשה": {
                    "תהליך פתיחת בקשה חדשה": [
                        {
                            cardType: "text",
                            content: `פותחים את ה PA30<br>
                            כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה.<br>
                            לאחר מכן לוחצים על בקשות.כותבים בסוג 418.<br>
                            לוחצים על צור (דף לבן בראש העמוד)והבקשה נפתחה<br>
                           חוזרים אחורה בחץ הירוק בראש העמוד<br>
                           לוחצים על פעילויות (לשים לב שאתן על אותו החייל)<br>
                            כותבים בסוג 418.<br>
                            ולוחצים על סקירה (שני הרים עם שמש)  לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה.<br>
                            מארגנים את המסכמים לכל קטגוריה. אחרי שאירכבתן את האישורים תעלה לכן המלצה בשולחן העבודה.
                           כותבות המלצה ומגישות
                           `
                        },
                    ],
                },
            }
        },
    },
    "כניסה לתפקיד": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 0,
        "questionsExam": [
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
        ],
        "learningContent": {
            // סוג הכרטיסייה
            "טיפים לתחילת התפקיד": {
                "טיפים לתחילת התפקיד": [
                    {
                        cardType: "text",
                        content: `טיפים לתחילת תפקיד: <br>
                        ההתחלה היא תמיד קשה אף אחד לא מצפה מכן שתדעו הכל על היום הראשון וגם לא על החודש הראשון, תנצלו את הזמן הזה להכיר את האנשים שמסביבכן ואת הבסיס שלכן כי בסופו של דבר האנשים זה מה שעושה את השירות.
                       התפקיד לא נוצץ כמו שמספרים לנו, אף אחד לא ירדוף אחריכן. זה תפקיד קשה ושוחק, יש בו המון צדדים יפים אבל גם המון צדדים קשים, כמו, בירוקרטיה, חוסר שעות שניה, חוסר שיתוף פעולה של מפקדים, חוסר הערכה. אבל למרות כל הקושיי, זה התפקיד הכי טוב בצהל,הסיפוק הוא אדיר והמשמעות היא מטורפת, אתן תכירו סיפורים ואנשים שלא תוכלו לפגוש באזרחות ,אנשים מדהימים שיהיו הכל בשבליכם, הלב שלכם יתרחב כל יום מחדש, ותעשו עוד המון דברים שהם לווא דווקא בגדר התפקיד, אלא בגדר היותכן חיילים בצהל. והתפקיד לפעמים סוחף וקשה לזכור שצריך לקחת שניה לעצמכם בתוך כל הטירוף הזה אל תשכחו את עצמכם,
                       אל תתביישו לשאול שאלות זה הדבר שהכי עוזר ללמוד, ומי שמתבייש מתייבש 
                        בהצלחה לכולם בתפקיד החדש והכי מושלם!
                       `
                    },
                ],
            },
        },
    },
    "הת״ש": {
        "icon": "../assets/images/learning/Artboard 4.svg",
        "amountOfQuestions": 4,
        "questionsExam": [
            {
                type: "multiple",
                question: `מה בקשת התש מאפשרת לחייל?`,
                ans1: `מאפשרת לחייל תוספת של ימי חופש`,
                ans2: `מאפשרת לחייל לצאת לבית בכל יום שירצו`,
                ans3: `מאפשרת לחייל שזקוק לשהות בבית יותר לצאת לבית באופן מטכלי. לפי מס ההתש שאושר כך מס הלילות`,
                ans4: `מאפשרת לחייל לישון בבית באופן קבוע`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `חייל שיתף כי לאמו גילו מחלה קשה. הוריו הינם גרושים ולחייל אין עוד אחים ואחיות . אמו של החייל מטופלת באופן קבוע בטיפולים הדורשים ממנה כוחות ומאמץ ואינה עובדת . אמן זקוקה לסיוע בהגעה לטיפולים, בסיוע בהכנת אוכל ובפעולות יום יומיות. מה השלב הראשון שצריך לעשות?`,
                ans1: `ללכת לביתו של החייל ולעזור בניקיון הבית`,
                ans2: `למסור לחייל שאין הבטחה שהבקשה תאושר`,
                ans3: `השלב הראשון בפתיחת הבקשה הוא להחתים את החייל על הצהרה לפתיחת הבקשה המצהירה כי החייל
                מעוניין לפתוח את הבקשה וכי ישתף פעולה בהבאת האישורים`,
                ans4: `לאסוף מכלל המשקיות תש כסף שיוכל לעזור לאמו בטיפולים הרפואיים`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `איזה אישורים נדרשים לבקשה?`,
                ans1: `עובר ושב של הוריו של החייל`,
                ans2: `לא נדרשים אישורים להגשת הבקשה`,
                ans3: `הצהרה של הוריו של החייל ושל מפקדו הישיר`,
                ans4: `מכתב אישי של החייל, פק״ל רפואי חתום 
                אישורים רפואיים נוספים של המוטב
                כל אישור שיכול לשפוך אור על המצב.
                החתמת כלל הגורמים הרלוונטים
                ביקור בית`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מי חותם על הפקל הרפואי של בן המשפחה עליו החייל מוציא התש?`,
                ans1: `קצינת התש`,
                ans2: `הוריו של החייל`,
                ans3: `בן המשפחה עליו החייל מוציא התש`,
                ans4: `רופא המשפחה`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה והחייל משרת ברמת פעילות א+:`,
                ans1: `הפרופיל של החייל ירד ל64`,
                ans2: `התש יוריד את החייל מלוחמה`,
                ans3: `חייל ברמת פעילות כזו אינו יכול להגיש בקשה כזו`,
                ans4: `לא ישנה לחייל את רמת הפעילות`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מי צריך להצטרף לביקור הבית אצל החייל?`,
                ans1: `משקית התש בלבד`,
                ans2: `משקית התש ומפקדו הישיר של החייל`,
                ans3: `משקית התש וקצינת התש`,
                ans4: `קצינת התש`,
                correctAns: "ans2"
            },
        ],
        // שאלות לנושא הזה
        "questionsPractice": [
            {
                type: "multiple",
                question: `מה בקשת התש מאפשרת לחייל?`,
                ans1: `מאפשרת לחייל תוספת של ימי חופש`,
                ans2: `מאפשרת לחייל לצאת לבית בכל יום שירצו`,
                ans3: `מאפשרת לחייל שזקוק לשהות בבית יותר לצאת לבית באופן מטכלי. לפי מס ההתש שאושר כך מס הלילות`,
                ans4: `מאפשרת לחייל לישון בבית באופן קבוע`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `חייל שיתף כי לאמו גילו מחלה קשה. הוריו הינם גרושים ולחייל אין עוד אחים ואחיות . אמו של החייל מטופלת באופן קבוע בטיפולים הדורשים ממנה כוחות ומאמץ ואינה עובדת . אמן זקוקה לסיוע בהגעה לטיפולים, בסיוע בהכנת אוכל ובפעולות יום יומיות. מה השלב הראשון שצריך לעשות?`,
                ans1: `ללכת לביתו של החייל ולעזור בניקיון הבית`,
                ans2: `למסור לחייל שאין הבטחה שהבקשה תאושר`,
                ans3: `השלב הראשון בפתיחת הבקשה הוא להחתים את החייל על הצהרה לפתיחת הבקשה המצהירה כי החייל
                מעוניין לפתוח את הבקשה וכי ישתף פעולה בהבאת האישורים`,
                ans4: `לאסוף מכלל המשקיות תש כסף שיוכל לעזור לאמו בטיפולים הרפואיים`,
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: `איזה אישורים נדרשים לבקשה?`,
                ans1: `עובר ושב של הוריו של החייל`,
                ans2: `לא נדרשים אישורים להגשת הבקשה`,
                ans3: `הצהרה של הוריו של החייל ושל מפקדו הישיר`,
                ans4: `מכתב אישי של החייל, פק״ל רפואי חתום 
                אישורים רפואיים נוספים של המוטב
                כל אישור שיכול לשפוך אור על המצב.
                החתמת כלל הגורמים הרלוונטים
                ביקור בית`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `מי חותם על הפקל הרפואי של בן המשפחה עליו החייל מוציא התש?`,
                ans1: `קצינת התש`,
                ans2: `הוריו של החייל`,
                ans3: `בן המשפחה עליו החייל מוציא התש`,
                ans4: `רופא המשפחה`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: `במידה והחייל משרת ברמת פעילות א+:`,
                ans1: `הפרופיל של החייל ירד ל64`,
                ans2: `התש יוריד את החייל מלוחמה`,
                ans3: `חייל ברמת פעילות כזו אינו יכול להגיש בקשה כזו`,
                ans4: `לא ישנה לחייל את רמת הפעילות`,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: `מי צריך להצטרף לביקור הבית אצל החייל?`,
                ans1: `משקית התש בלבד`,
                ans2: `משקית התש ומפקדו הישיר של החייל`,
                ans3: `משקית התש וקצינת התש`,
                ans4: `קצינת התש`,
                correctAns: "ans2"
            },
        ],
        "learningContent": {
            // סוג הכרטיסייה
            "הגדרה": {
                "הגדרה": [
                    {
                        cardType: "text",
                        content: `הקלות בתנאי שירות זוהי בקשה המאפשרת לחייל שזקוק לשהות בבית יותר לצאת לבית באופן
                            מטכלי. לפי מס ההתש שאושר כך מס הלילות . לדוגמא: התש 3- שלוש לילות בבית,
                           התש 5 - חמישה לילות בבית וכן הלאה.<br>
                            *שישי ושבת נחשב כלילה אחד.
                            כמו שלמדתם יש התש רפואי והתש כלכלי.
                           `
                    },
                ],
            },
            "אישורים נדרשים": {
                "אישורים נדרשים": [
                    {
                        cardType: "text",
                        content: `שלב הראשון בפתיחת הבקשה הוא להחתים את החייל על הצהרה לפתיחת הבקשה המצהירה כי החייל
                            מעוניין לפתוח את הבקשה וכי ישתף פעולה בהבאת האישורים.
                            לאחר מכן מציגה את האישורים שהחייל זקוק לבקשה:<br>
                            מכתב אישי של החייל<br>
                            פק״ל רפואי חתום <br>
                            אישורים רפואיים נוספים של המוטב<br>
                            כל אישור שיכול לשפוך אור על המצב.<br>
                            החתמת כלל הגורמים הרלוונטים<br>
                            ביקור בית
                           `
                    },
                ],
            },
            "דגשים": {
                "דגשים": [
                    {
                        cardType: "text",
                        content: `את הפקל הרפואי החייל מחתים את הרופא משפחה של בן המשפחה בו הוא חותם כי מוכנים לוותר על ההחיסיון הרפואי. בנוסף הוא שופך אור על מצבה התפקודי היום יומי.
                            לאחר שהחייל יגיש לי את הפקל הרפואי אני אחתים דרגת סאל ואת רופא היחידה מה הם ממליצים לכך- יש ממש סעיף לכל אחד מהם על איזה התש הם ממליצים, האם הם ממליצים ובנוסף גם המפקד חטיבה והקצינת תש יחתמו.
                           `
                    },
                    {
                        cardType: "text",
                        content: `במידה והחייל משרת ברמת פעילות א+ התש יוריד את החייל מלוחמה ולכן התש
                        בלוחמה הוא לשיקולם של המפקדים ונקרא התש פיקודי.<br>
                        בנוסף לשאר האישורים משקית תש תבצע ביקור בית עם המפקד - בסוף הביקור בית המפקד ימלא
                        חווד ויגיד אם הוא ממליץ לאשר או לא, שימו לב כי חווד המפקד הוא חשוב !<br>
                        לאחר קבלת כלל האישורים וחתימות על הפקל נשאר לנו לכתוב מכתב סימוכין.<br>
                        מכתב סימוכין הוא מין מכתב התרכז את כל הנתונים של הבקשה, את הפרטים של החייל של אמו ושל משפחתו כלל. בנוסף את המלצת המשקיות וריכוז האישורים.<br>
                        אסרוק את האישורים - טיפ ממני- סורקת את אישוריי החייל מראשו בעת סריקת המסמכים לשמור את המסמכים בשמם ובנפרד בתקיה שאת יוצרת לחייל. בעת הארכוב יקח לכם/ן יותר מהר ויותר קל
                       `
                    },
                ],
            },
            "פתיחת הבקשה": {
                "פתיחת הבקשה": [
                    {
                        cardType: "text",
                        content: `יש לצלם את המסך כדי להראות את האופן פתיחת הבקשה,פותחים את הPA30<br>
                        כותבים את המספר האישי של החייל או את שמו המלא בחלונית הלבנה.<br>
                        לאחר מכן לוחצים על בקשות.כותבים בסוג 466.<br>
                       לוחצים על צור (דף לבן בראש העמוד)מזל טובב פתחתן את הבקשה<br>
                        חוזרים אחורה בחץ הירוק בראש העמוד<br>
                        לוחצים על פעילויות (לשים לב שאתן על אותו החייל)<br>
                        כותבים בסוג 466.<br>
                        ולוחצים על סקירה (שני הרים עם שמש)<br>
                        לאחר מכן יופיעו לכן כל סוגי האישורים הנדרשים לבקשה.מארכבים את המסכמים לכל קטגוריה. כותבים בסוג 466.<br>
                       אחרי שאירכבתן את האישורים תעלה לכן המלצה בשולחן העבודה. כותבות המלצה ומגישות
                       `
                    },
                ],
            },
            // "": {
            //     "": [
            //         {
            //             cardType: "text",
            //             content: `<pre></pre>`
            //         },
            //     ],
            // },
        },
    },
    // "": {
    //     "icon": "../assets/images/learning/Artboard 4.svg",
    //     "amountOfQuestions": 4,
    //     "questionsExam": [
    //                     {
    //             type: "multiple",
    //             question: ``,
    //             ans1: ``,
    //             ans2: ``,
    //             ans3: ``,
    //             ans4: ``,
    //             correctAns: "ans3"
    //         },
    //     ],
    //     // שאלות לנושא הזה
    //     "questionsPractice": [
    //         {
    //             type: "multiple",
    //             question: ``,
    //             ans1: ``,
    //             ans2: ``,
    //             ans3: ``,
    //             ans4: ``,
    //             correctAns: "ans3"
    //         },
    //     ],
    //     "learningContent": {
    //         // סוג הכרטיסייה
    //         "תת-נושא": {
    //             "כותרת הבטיסיה": [
    //                 {
    //                     cardType: "text",
    //                     content: ``
    //                 }
    //             ]
    //         }
    //     },
    // },
};





/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        if (json.subTitle3 && json.content3) {
            card.querySelector(".sub-title3").innerHTML = json.subTitle3;
            card.querySelector(".content3").innerHTML = json.content3;
        }
    }
}

CARD_TYPES.list3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}
CARD_TYPES.youtube = {
    init(card, json) {
        card.querySelector(".youtube").src = json.youtube;

    }
}
